{"title": "7 midcap stocks with rising EPS over four quarters. Are you missing out?", "link": "https://economictimes.indiatimes.com/markets/stocks/news/7-midcap-stocks-with-rising-eps-over-four-quarters-are-you-missing-out/slideshow/126004134.cms", "published": "2025-12-16T17:43:01+00:00", "summary": "Seven NSE midcap companies have delivered consistent EPS growth for four consecutive quarters till September, signalling improving profitability, strong execution and potential for sustainable earnings momentum, as per StockEdge data.", "source": "https://economictimes.indiatimes.com/markets/stocks/rssfeeds/2146843.cms"}
{"title": "Nasdaq is planning for near 24-hour trading. What does it mean for Indian stock markets?", "link": "https://economictimes.indiatimes.com/markets/stocks/news/nasdaq-is-planning-for-24-hour-trading-what-does-it-mean-for-indian-stock-markets/articleshow/126003549.cms", "published": "2025-12-16T17:23:49+00:00", "summary": "Nasdaq’s plan for 24x7 trading could change how Indian markets absorb global cues, with price discovery becoming continuous rather than overnight. Experts say this may increase opening gaps and short-term volatility in globally sensitive sectors, even as India’s long-term market drivers remain largely domestic.", "source": "https://economictimes.indiatimes.com/markets/stocks/rssfeeds/2146843.cms"}
{"title": "Gainers &amp; Losers: Vedanta, Axis Bank among 7 stocks under the spotlight on Tuesday", "link": "https://economictimes.indiatimes.com/markets/stocks/news/gainers-amp-losers-vedanta-axis-bank-among-7-stocks-under-the-spotlight-on-tuesday/slideshow/126003241.cms", "published": "2025-12-16T17:05:34+00:00", "summary": "Vedanta, Meesho and SEPC saw sharp gains, while Axis Bank, Ola Electric and Policybazaar declined as markets ended lower amid broad-based selling on Tuesday.", "source": "https://economictimes.indiatimes.com/markets/stocks/rssfeeds/2146843.cms"}
{"title": "Stock Radar: Delhivery down from November 2025 highs; what should investors do?", "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-radar-delhivery-down-from-november-2025-highs-what-should-investors-do/articleshow/125978205.cms", "published": "2025-12-16T17:01:00+00:00", "summary": "Delhivery Ltd has failed to sustain its record highs, with chart patterns indicating a potential continuation of weakness. Experts suggest short-to-medium term traders consider selling the stock now or on a minor bounce, targeting Rs 370-380 in the next 1-2 months. The stock is currently in a short-term downtrend, trading below key moving averages.", "source": "https://economictimes.indiatimes.com/markets/stocks/rssfeeds/2146843.cms"}
{"title": "Wall Street banks prepare for round-the-clock stock trading, reluctantly", "link": "https://economictimes.indiatimes.com/markets/stocks/news/wall-street-banks-prepare-for-round-the-clock-stock-trading-reluctantly/articleshow/126002919.cms", "published": "2025-12-16T16:49:25+00:00", "summary": "Round-the-clock trading is fast approaching U.S. stock markets, but not all of Wall Street is embracing the move. Several of the largest U.S. banks are reluctant to push aggressively into enabling round-the-clock stock trading, even as equity markets are marching toward a broad rollout of nearly nonstop trading later next year and exchanges are preparing for action.", "source": "https://economictimes.indiatimes.com/markets/stocks/rssfeeds/2146843.cms"}
{"title": "Market Wrap: Sensex slides 533 pts, Nifty below 25,900 as foreign outflows, weak rupee pressure markets", "link": "https://economictimes.indiatimes.com/markets/stocks/news/market-wrap-sensex-slides-533-pts-nifty-below-25900-as-foreign-outflows-weak-rupee-pressure-markets/articleshow/126001624.cms", "published": "2025-12-16T15:42:00+00:00", "summary": "Indian equities extended their decline for a second consecutive session on Tuesday, with both the Sensex and Nifty closing lower. Persistent foreign portfolio outflows and a weakening rupee contributed to investor caution, further amplified by uncertainty surrounding a potential U.S. trade deal.", "source": "https://economictimes.indiatimes.com/markets/stocks/rssfeeds/2146843.cms"}
{"title": "Gujarat Kidney and Super Speciality IPO: Company sets price band at Rs 108 – Rs 114 per share. Check GMP, other details", "link": "https://economictimes.indiatimes.com/markets/stocks/news/gujarat-kidney-and-super-speciality-ipo-company-sets-price-band-at-rs-108-rs-114-per-share-check-gmp-other-details/articleshow/126000641.cms", "published": "2025-12-16T14:56:23+00:00", "summary": "Gujarat Kidney and Super Speciality has set a price band of ₹108–114 for its ₹251 crore IPO, which will open for subscription from December 22 to 24, 2025. The issue is a fresh offer of up to 2.2 crore shares, with allocations of 75% for QIBs, 15% for NIIs and 10% for retail investors.", "source": "https://economictimes.indiatimes.com/markets/stocks/rssfeeds/2146843.cms"}
{"title": "Vedanta shares jump 4%, hit 52-week high after NCLT approves demerger plan", "link": "https://economictimes.indiatimes.com/markets/stocks/news/nclt-approves-vedantas-demerger-plan-stock-jumps-3/articleshow/126000529.cms", "published": "2025-12-16T14:50:45+00:00", "summary": "Vedanta shares surged to a 52-week high after the NCLT approved its demerger plan, creating five distinct entities. This approval provides significant relief following earlier government objections. The company is now set to implement the scheme, aiming for focused, sector-leading businesses.", "source": "https://economictimes.indiatimes.com/markets/stocks/rssfeeds/2146843.cms"}
{"title": "Elon Musk now 4 times richer than Warren Buffett, after making more in 1 day than Oracle of Omaha’s entire fortune", "link": "https://economictimes.indiatimes.com/markets/stocks/news/elon-musk-now-4-times-richer-than-warren-buffett-after-making-more-in-1-day-than-oracle-of-omahas-entire-fortune/articleshow/126000533.cms", "published": "2025-12-16T14:49:57+00:00", "summary": "Elon Musk’s net worth surged past $600 billion after a sharp one-day jump, driven by a major revaluation of SpaceX. The rise has widened the gap between Musk and other global billionaires, highlighting SpaceX’s growing role in his wealth and fuelling speculation about a future trillionaire milestone.", "source": "https://economictimes.indiatimes.com/markets/stocks/rssfeeds/2146843.cms"}
{"title": "These 9 stocks added by over 15 MFs in November ’25 surge up to 115% in FY26. Do you own any?", "link": "https://economictimes.indiatimes.com/markets/stocks/news/these-9-stocks-added-by-over-15-mfs-in-november-25-surge-up-to-115-in-fy26-do-you-own-any/slideshow/126000470.cms", "published": "2025-12-16T14:34:41+00:00", "summary": "Mutual funds stepped up equity buying in November 2025, adding nine stocks across multiple schemes amid strong inflows. These stocks witnessed rising institutional confidence and delivered double-digit returns in FY26 so far. The trend highlights sustained MF conviction in select large and mid-cap names across sectors.", "source": "https://economictimes.indiatimes.com/markets/stocks/rssfeeds/2146843.cms"}
{"title": "Japan's Nikkei slumps as AI stocks tumble ahead of US jobs data", "link": "https://economictimes.indiatimes.com/markets/stocks/news/japans-nikkei-slumps-as-ai-stocks-tumble-ahead-of-us-jobs-data/articleshow/126000170.cms", "published": "2025-12-16T14:28:21+00:00", "summary": "Japan's Nikkei share average dropped more than 1% on Tuesday, weighed down by declines in chip and other artificial intelligence-linked stocks ahead of crucial U.S. employment data later in the day.", "source": "https://economictimes.indiatimes.com/markets/stocks/rssfeeds/2146843.cms"}
{"title": "European shares edge lower ahead of crucial US jobs data", "link": "https://economictimes.indiatimes.com/markets/stocks/news/european-shares-edge-lower-ahead-of-crucial-us-jobs-data/articleshow/126000114.cms", "published": "2025-12-16T14:24:58+00:00", "summary": "European shares drifted lower on Tuesday, pulling back after robust gains in the previous session, while investor caution ahead of crucial U.S. jobs data added to the dour mood.", "source": "https://economictimes.indiatimes.com/markets/stocks/rssfeeds/2146843.cms"}
{"title": "PB Fintech shares decline 6% amid reports of regulatory push to cap insurance agent commissions", "link": "https://economictimes.indiatimes.com/markets/stocks/news/pb-fintech-shares-decline-6-amid-reports-of-regulatory-push-to-cap-insurance-agent-commissions/articleshow/125999687.cms", "published": "2025-12-16T14:01:47+00:00", "summary": "PB Fintech shares fell amid concerns that the proposed Insurance Bill 2025 could allow IRDAI to cap insurance agent commissions, raising regulatory risks for digital insurance marketplaces and intermediaries.", "source": "https://economictimes.indiatimes.com/markets/stocks/rssfeeds/2146843.cms"}
{"title": "F&amp;O Radar| Deploy Batman strategy in Nifty for potential gains from a sideways index", "link": "https://economictimes.indiatimes.com/markets/stocks/news/fo-radar-deploy-batman-strategy-in-nifty-for-potential-gains-from-a-sideways-index/articleshow/125998699.cms", "published": "2025-12-16T13:08:02+00:00", "summary": "Nifty’s recent consolidation has opened up tactical opportunities for options traders. With FIIs building short positions and volatility staying muted, ICICI Securities’ Jay Thakkar suggests deploying a Batman strategy to benefit from sideways movement, while clearly defining profit zones and stop-loss levels.", "source": "https://economictimes.indiatimes.com/markets/stocks/rssfeeds/2146843.cms"}
{"title": "PVR Inox shares may gain another 15% on Dhurandhar buzz, upcoming releases, says MOFSL analyst", "link": "https://economictimes.indiatimes.com/markets/stocks/news/pvr-inox-shares-may-gain-another-15-on-dhurandhar-box-office-success-upcoming-releases-says-mofsl-analyst/articleshow/125998542.cms", "published": "2025-12-16T12:56:44+00:00", "summary": "PVR Inox shares rose on Tuesday as strong box-office collections from Dhurandhar lifted optimism around the cinema chain stock. Motilal Oswal's Nandish Shah sees up to 15% upside, citing a robust film pipeline and improving occupancy, while cautioning that earnings remain sensitive to content quality and footfalls.", "source": "https://economictimes.indiatimes.com/markets/stocks/rssfeeds/2146843.cms"}
{"title": "Bengaluru gives India another billionaire. Who is IIT engineer &amp; Meesho cofounder Vidit Aatrey?", "link": "https://economictimes.indiatimes.com/markets/stocks/news/bengaluru-gives-india-another-billionaire-who-is-iit-engineer-meesho-cofounder-vidit-aatrey/articleshow/125998435.cms", "published": "2025-12-16T12:52:11+00:00", "summary": "Meesho co-founder and CEO Vidit Aatrey has joined India’s billionaire club after the newly listed e-commerce firm’s shares surged 13% to a fresh high. The rally lifted Meesho’s market value past Rs 85,000 crore, boosting Aatrey’s 11.1% stake beyond $1 billion.", "source": "https://economictimes.indiatimes.com/markets/stocks/rssfeeds/2146843.cms"}
{"title": "Rs 32,000 crore surge in 6 days! Silver’s record rally powers 15% jump in Hindustan Zinc stock. What’s next for investors?", "link": "https://economictimes.indiatimes.com/markets/stocks/news/rs-32000-crore-surge-in-6-days-silvers-record-rally-powers-15-jump-in-hindustan-zinc-stock-whats-next-for-investors/articleshow/125998326.cms", "published": "2025-12-16T12:48:55+00:00", "summary": "Hindustan Zinc shares have surged on a record rally in silver prices, rising 15% in six sessions and adding ₹32,000 crore in market value, as silver crossed ₹2 lakh on MCX and hit about $65 globally. Supported by low-cost zinc operations, the stock is up over 28% in 2025, with investors now weighing whether the momentum can extend into 2026.", "source": "https://economictimes.indiatimes.com/markets/stocks/rssfeeds/2146843.cms"}
{"title": "SEPC shares zoom 8% on Rs 270 crore railway order win from North Western Railway", "link": "https://economictimes.indiatimes.com/markets/stocks/news/sepc-shares-zoom-8-on-rs-270-crore-railway-order-win-from-north-western-railway/articleshow/125998224.cms", "published": "2025-12-16T12:45:49+00:00", "summary": "C jumped after the company won a ₹269.69 crore railway infrastructure contract for the Ajmer–Chanderiya Doubling Project under North Western Railway.", "source": "https://economictimes.indiatimes.com/markets/stocks/rssfeeds/2146843.cms"}
{"title": "From a long-term investing perspective: 5 mid-caps from different sectors with strong brands, and upside potential of up to 27%", "link": "https://economictimes.indiatimes.com/markets/stocks/news/from-a-long-term-investing-perspective-5-mid-caps-from-different-sectors-with-strong-brands-and-upside-potential-of-up-to-27/articleshow/125996740.cms", "published": "2025-12-16T11:49:58+00:00", "summary": "Tata, Birla, Ambani, Adani. These are not just names, they are also brands… brands that have even seeped into popular culture. But do all widely recognizable brands belong to large-cap companies? While most do, there are several mid-cap companies that have also built brands that have huge recall value. When they do that, it gives them an edge that many of their competitors lack. This edge is not easy to build as it not only requires capital, but foresight on part of the promoters. As also a system in process in the company which owns that brand. So, what does owning a strong brand mean in the end? The ability to price, to endure a slowdown much better. And also brand extension.", "source": "https://economictimes.indiatimes.com/markets/stocks/rssfeeds/2146843.cms"}
{"title": "Shakti Pumps shares gain 40% in just 4 days. What's fuelling the rally?", "link": "https://economictimes.indiatimes.com/markets/stocks/news/shakti-pumps-shares-gain-40-in-just-4-days-whats-fuelling-the-rally/articleshow/125997049.cms", "published": "2025-12-16T11:46:31+00:00", "summary": "Shakti Pumps’ shares surged for the fourth consecutive day, driven by multiple large solar pump orders across Maharashtra, Jharkhand, and Madhya Pradesh. The strong order inflow underscores its leadership in solar-powered irrigation solutions, boosting market confidence. Technical indicators show healthy momentum, supporting continued investor interest amid positive sectoral trends.", "source": "https://economictimes.indiatimes.com/markets/stocks/rssfeeds/2146843.cms"}
{"title": "Axis Bank shares slide 4% as Citi Research warns of delayed NIM recovery", "link": "https://economictimes.indiatimes.com/markets/stocks/news/axis-bank-shares-tumble-4-as-citi-research-sees-no-upside-reiterates-neutral-stance/articleshow/125996940.cms", "published": "2025-12-16T11:41:38+00:00", "summary": "Axis Bank shares dropped 4% after management delayed its NIM recovery outlook, now expecting margins to bottom out in Q4 or early Q1. While fee income remains constrained and profitability has softened, easing stress in retail portfolios and improving corporate demand offer some support. The stock is still up 16% year to date.", "source": "https://economictimes.indiatimes.com/markets/stocks/rssfeeds/2146843.cms"}
{"title": "IITian Vidit Aatrey joins billionaire club as Meesho shares rocket 74% from issue price", "link": "https://economictimes.indiatimes.com/markets/stocks/news/meesho-founder-vidit-aatrey-joins-the-billionaire-club-as-stock-rockets-74-from-issue-price/articleshow/125996583.cms", "published": "2025-12-16T11:22:08+00:00", "summary": "Meesho Ltd’s shares surged more than 74% from their issue price days after listing, lifting co-founder Vidit Aatrey into the billionaire club as investor enthusiasm builds around the e-commerce firm’s post-IPO momentum.", "source": "https://economictimes.indiatimes.com/markets/stocks/rssfeeds/2146843.cms"}
{"title": "India market regulator panel to recommend easing rules for commodity derivatives, sources say", "link": "https://economictimes.indiatimes.com/markets/stocks/news/india-market-regulator-panel-to-recommend-easing-rules-for-commodity-derivatives-sources-say/articleshow/125996567.cms", "published": "2025-12-16T11:17:14+00:00", "summary": "India's market regulator SEBI's panel will soon suggest easing curbs on commodity derivatives. The report will propose making these markets more attractive to institutional investors. Bans on derivatives trading for seven agricultural commodities may be lifted. The panel also recommends changes to tax laws and allowing trading firms to colocate on exchange premises.", "source": "https://economictimes.indiatimes.com/markets/stocks/rssfeeds/2146843.cms"}
{"title": "Elon Musk’s fortune breaks the $600 billion mark as new SpaceX valuation ignites wealth surge", "link": "https://economictimes.indiatimes.com/markets/stocks/news/elon-musks-fortune-breaks-the-600-billion-mark-as-new-spacex-valuation-ignites-wealth-surge/articleshow/125996474.cms", "published": "2025-12-16T11:10:30+00:00", "summary": "Elon Musk has reached a new financial milestone. His net worth has crossed $600 billion for the first time. This surge is thanks to a fresh valuation of his company, SpaceX. The private rocket maker is now valued at $800 billion. This makes SpaceX the world's most valuable private firm. Musk's stake in SpaceX is worth over $317 billion.", "source": "https://economictimes.indiatimes.com/markets/stocks/rssfeeds/2146843.cms"}
{"title": "Meesho shares zoom 13% to fresh peak; market cap tops Rs 85,000 crore", "link": "https://economictimes.indiatimes.com/markets/stocks/news/meesho-shares-zoom-13-to-fresh-peak-market-cap-tops-rs-85000-crore/articleshow/125995983.cms", "published": "2025-12-16T10:39:17+00:00", "summary": "Newly listed Meesho shares rose sharply to a fresh high, pushing the company's market capitalisation past Rs 85,000 crore despite weak broader markets. Strong trading volumes and a bullish initiation by Choice Institutional Equities, citing a faster path to profitability, reinforced investor confidence in the stock’s post-listing rally.", "source": "https://economictimes.indiatimes.com/markets/stocks/rssfeeds/2146843.cms"}
{"title": "Fertilizer stocks Rashtriya Chemicals, Paradeep Phosphates, others soar up to 7%. What’s fuelling the surge today?", "link": "https://economictimes.indiatimes.com/markets/stocks/news/fertilizer-stocks-rashtriya-chemicals-paradeep-phosphates-others-soar-up-to-7-whats-fuelling-the-surge-today/articleshow/125995730.cms", "published": "2025-12-16T10:24:39+00:00", "summary": "Fertiliser stocks surged as Finance Minister Nirmala Sitharaman assured no shortage of urea for the current rabi season. The government has ramped up urea imports and increased subsidies to ensure farmers receive adequate nutrients at affordable prices.  India's urea imports more than doubled during April-October to meet domestic demand.", "source": "https://economictimes.indiatimes.com/markets/stocks/rssfeeds/2146843.cms"}
{"title": "Despite up to 35% fall, FII ownership rises most in 10 IT stocks including Hexaware, Tata Technologies", "link": "https://economictimes.indiatimes.com/markets/stocks/news/despite-up-to-35-fall-fii-ownership-rises-most-in-10-it-stocks-including-hexaware-tata-technologies/slideshow/125995902.cms", "published": "2025-12-16T10:24:38+00:00", "summary": "Despite a challenging year for the IT sector, with many stocks experiencing significant declines, foreign institutional investors (FIIs) have strategically increased their stakes in select companies. Ten IT stocks, including Hexaware and Tata Technologies, have seen the most substantial FII ownership growth, signaling confidence amidst market volatility.", "source": "https://economictimes.indiatimes.com/markets/stocks/rssfeeds/2146843.cms"}
{"title": "Buy, Sell or Hold: Citi maintains buy on ICICI Bank; Motilal Oswal remains neutral on Bajaj Auto", "link": "https://economictimes.indiatimes.com/markets/stocks/news/buy-sell-or-hold-citi-maintains-buy-on-icici-bank-motilal-oswal-remains-neutral-on-bajaj-auto/articleshow/125995557.cms", "published": "2025-12-16T10:11:46+00:00", "summary": "Brokerage calls remain stock-specific in a mixed market. Citi has reiterated its Buy rating on ICICI Bank, citing diversified loan growth and steady earnings visibility, while Motilal Oswal has maintained a Neutral view on Bajaj Auto, balancing strong exports and EV ambitions against execution and market-share recovery risks.", "source": "https://economictimes.indiatimes.com/markets/stocks/rssfeeds/2146843.cms"}
{"title": "Adani Power shares can rally 30%, says Antique after initiating coverage with 'Buy' rating. Here’s why", "link": "https://economictimes.indiatimes.com/markets/stocks/news/adani-power-shares-can-rally-30-says-antique-after-initiating-coverage-with-buy-rating-heres-why/articleshow/125995320.cms", "published": "2025-12-16T10:01:38+00:00", "summary": "Adani Power shares could rally up to 30%, says Antique Stock Broking, which has initiated coverage with a Buy rating. The brokerage cites a strong earnings upcycle driven by aggressive capacity expansion, rising baseload power demand, and improved cash-flow visibility from long-term PPAs.", "source": "https://economictimes.indiatimes.com/markets/stocks/rssfeeds/2146843.cms"}
{"title": "Risk-off 2025 brings largecaps back on top after two-year hiatus; what does 2026 hold?", "link": "https://economictimes.indiatimes.com/markets/stocks/news/risk-off-2025-brings-largecaps-back-on-top-after-two-year-hiatus-what-does-2026-hold/articleshow/125995265.cms", "published": "2025-12-16T09:58:50+00:00", "summary": "Large-cap stocks are poised to finish 2025 as top performers, outshining mid and small-cap peers and reaffirming their safe-haven status. This year has seen big companies reclaim their defensive edge, a shift from the broader market's dominance in previous years. Despite a volatile first half, largecaps have shown resilience, with many delivering positive returns.", "source": "https://economictimes.indiatimes.com/markets/stocks/rssfeeds/2146843.cms"}
{"title": "Sebi launches Rs 18 crore recovery proceedings against ‘Baap of Charts’ finfluencer, others", "link": "https://economictimes.indiatimes.com/markets/stocks/news/sebi-launches-rs-18-crore-recovery-proceedings-against-baap-of-charts-finfluencer-others/articleshow/125994841.cms", "published": "2025-12-16T09:28:58+00:00", "summary": "Market regulator Sebi has initiated recovery proceedings against finfluencer 'Baap of Charts' (Mohammad Nasiruddin Ansari), Rahul Rao Padamati, and Golden Syndicate Ventures Pvt. Ltd. for failing to pay dues totaling around Rs 18 crore. Sebi previously banned Ansari for acting as an unregistered investment adviser, luring investors with promises of profit.", "source": "https://economictimes.indiatimes.com/markets/stocks/rssfeeds/2146843.cms"}
{"title": "Sensex falls over 400 pts, Nifty below 25,950 as US trade deal uncertainty drags", "link": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-drops-over-300-pts-nifty-below-26000-as-us-trade-deal-uncertainty-drags/articleshow/125994720.cms", "published": "2025-12-16T09:27:46+00:00", "summary": "Indian stock markets opened lower today. The Sensex and Nifty declined, continuing yesterday's trend. Foreign investors are selling shares. The Indian rupee weakened against the dollar. Uncertainty surrounds a trade deal with the United States. Broader markets also faced pressure. Investors await new developments and clarity on the trade agreement.", "source": "https://economictimes.indiatimes.com/markets/stocks/rssfeeds/2146843.cms"}
{"title": "Nifty to trounce S&amp;P 500 in 2026 comeback, predicts BofA's Amish Shah but 4 major threats loom", "link": "https://economictimes.indiatimes.com/markets/stocks/news/nifty-to-trounce-sp-500-in-2026-comeback-predicts-bofas-amish-shah-but-4-major-threats-loom/articleshow/125994804.cms", "published": "2025-12-16T09:26:20+00:00", "summary": "BofA predicts Nifty will trounce the S&amp;P 500 in 2026 with an 11-12% surge, reversing a tough 2025. This optimism is fueled by improving earnings visibility and expected foreign investor inflows. However, currency fluctuations, crude oil prices, a delayed India-US trade deal, and a potential US AI bubble pose significant risks.", "source": "https://economictimes.indiatimes.com/markets/stocks/rssfeeds/2146843.cms"}
{"title": "Kaynes Technology among 5 F&amp;O stocks with a sharp rise in futures open interest", "link": "https://economictimes.indiatimes.com/markets/stocks/news/kaynes-technology-among-5-fo-stocks-with-a-sharp-rise-in-futures-open-interest/slideshow/125994752.cms", "published": "2025-12-16T09:19:15+00:00", "summary": "As of December 15, five stocks in the NSE F&amp;O segment witnessed a sharp rise in futures open interest, signalling increased derivatives activity and expanding trader positions. Kaynes Technology India, Sammaan Capital, BSE, Life Insurance Corporation of India and ICICI Prudential Life Insurance Company recorded notable OI gains, indicating heightened market participation.", "source": "https://economictimes.indiatimes.com/markets/stocks/rssfeeds/2146843.cms"}
{"title": "Citi picks Infosys and HCL Tech over other large-cap IT stocks as recovery remains slow", "link": "https://economictimes.indiatimes.com/markets/stocks/news/citi-picks-infosys-and-hcl-tech-over-other-large-cap-it-stocks-as-recovery-remains-slow/articleshow/125994536.cms", "published": "2025-12-16T09:03:21+00:00", "summary": "Citi has maintained a cautious view on the IT services sector, citing a slow and uncertain recovery in demand. Within Indian IT, the brokerage prefers Infosys and HCL Technologies over other large-cap peers, even as it keeps a guarded stance on the sector and says a macro-led rebound has yet to materialise.", "source": "https://economictimes.indiatimes.com/markets/stocks/rssfeeds/2146843.cms"}
{"title": "Inox Wind shares in focus on second order win in 2 days. Check details", "link": "https://economictimes.indiatimes.com/markets/stocks/news/inox-wind-shares-in-focus-on-second-order-win-in-2-days-check-details/articleshow/125994511.cms", "published": "2025-12-16T09:01:53+00:00", "summary": "Inox Wind's shares are expected to see activity following a new 100-MW order from Jakson Green. This follows a recent 102.3-MW order from ABREL EPC. These orders could significantly boost the company's order book. Inox Wind recently reported its strongest second-quarter results, showing improved execution and profitability. The company is well-positioned for future growth.", "source": "https://economictimes.indiatimes.com/markets/stocks/rssfeeds/2146843.cms"}
{"title": "NBCC, GMDC and 4 other stocks that flash bullish signals, indicating possible uptrend", "link": "https://economictimes.indiatimes.com/markets/stocks/news/nbcc-gmdc-and-4-other-stocks-that-flash-bullish-signals-indicating-possible-uptrend/slideshow/125994565.cms", "published": "2025-12-16T09:00:29+00:00", "summary": "6 stocks in the Nifty200 pack appeared on the bullish scanner of \"White Marubozu,\" according to stockedge.com's technical scan data.", "source": "https://economictimes.indiatimes.com/markets/stocks/rssfeeds/2146843.cms"}
{"title": "HDFC Life, SBI Life, among other insurance stocks in focus as govt set to table insurance bill to hike FDI limit", "link": "https://economictimes.indiatimes.com/markets/stocks/news/hdfc-life-sbi-life-among-other-insurance-stocks-in-focus-as-govt-set-to-table-insurance-bill-to-hike-fdi-limit/articleshow/125994408.cms", "published": "2025-12-16T08:56:37+00:00", "summary": "Insurance stocks may remain in focus as the government moves to introduce the Sabka Bima Sabki Raksha Bill in Parliament. The proposal to allow 100% FDI, alongside governance safeguards, is expected to improve sector transparency, ease of doing business and long-term insurance penetration in India.", "source": "https://economictimes.indiatimes.com/markets/stocks/rssfeeds/2146843.cms"}
{"title": "Texmaco Rail shares in focus on winning Rs 132 crore wagon supply order", "link": "https://economictimes.indiatimes.com/markets/stocks/news/texmaco-rail-shares-in-focus-on-winning-rs-132-crore-wagon-supply-order/articleshow/125994361.cms", "published": "2025-12-16T08:47:20+00:00", "summary": "Texmaco Rail shares: The company's JV, Touax Texmaco Railcar Leasing, bagged a ₹132 crore domestic order to supply a rake of BLSS and BVCM wagons.", "source": "https://economictimes.indiatimes.com/markets/stocks/rssfeeds/2146843.cms"}
{"title": "Japan's Nikkei falls 1% as AI stocks slip ahead of US jobs data", "link": "https://economictimes.indiatimes.com/markets/stocks/news/japans-nikkei-falls-1-as-ai-stocks-slip-ahead-of-us-jobs-data/articleshow/125994287.cms", "published": "2025-12-16T08:42:41+00:00", "summary": "Japan's Nikkei index fell over 1 percent on Tuesday. This decline was driven by losses in chip and AI-related stocks. Investors are adopting a cautious approach. They await key US employment data today and the Bank of Japan's policy decision on Friday. Many stocks on the Nikkei saw drops, with only airlines and agriculture sectors trading higher.", "source": "https://economictimes.indiatimes.com/markets/stocks/rssfeeds/2146843.cms"}
{"title": "Delhivery shares in focus after launching on-demand delivery in Mumbai, Hyderabad", "link": "https://economictimes.indiatimes.com/markets/stocks/news/delhivery-shares-in-focus-after-launching-on-demand-delivery-in-mumbai-hyderabad/articleshow/125994261.cms", "published": "2025-12-16T08:41:57+00:00", "summary": "Delhivery is launching its on-demand intracity shipping service, Delhivery Direct, in Mumbai and Hyderabad, offering rapid pickups for small businesses and individuals. This expansion follows a Q2 where the company reported record shipment volumes despite a net loss. The service aims to cater to the growing demand for local logistics across India.", "source": "https://economictimes.indiatimes.com/markets/stocks/rssfeeds/2146843.cms"}
{"title": "Biocon among 5 stocks showing bullish RSI upswing", "link": "https://economictimes.indiatimes.com/markets/stocks/news/biocon-among-5-stocks-showing-bullish-rsi-upswing/slideshow/125994268.cms", "published": "2025-12-16T08:38:34+00:00", "summary": "Five Nifty200 stocks showed improving momentum on December 15 as their RSI moved above the 50 mark, indicating early accumulation. The rising RSI reflects strengthening buying interest after consolidation, suggesting a shift towards a positive trend bias and offering traders potential continuation opportunities amid gradually improving market sentiment.", "source": "https://economictimes.indiatimes.com/markets/stocks/rssfeeds/2146843.cms"}
{"title": "RBL Bank shares in focus as CFO Buvanesh Tharashankar resigns with immediate effect", "link": "https://economictimes.indiatimes.com/markets/stocks/news/rbl-bank-shares-in-focus-as-cfo-buvanesh-tharashankar-resigns-with-immediate-effect/articleshow/125993707.cms", "published": "2025-12-16T08:08:21+00:00", "summary": "RBL Bank shares will be in focus following the immediate resignation of its Chief Financial Officer, Buvanesh Tharashankar. Tharashankar stepped down to pursue opportunities outside the organization. The bank has already identified an interim successor as part of its succession plan. His resignation was accepted on December 15, with his duties ceasing that day.", "source": "https://economictimes.indiatimes.com/markets/stocks/rssfeeds/2146843.cms"}
{"title": "HDFC Bank shares in focus as RBI approves up to 9.5% stake acquisition in IndusInd Bank by group entities", "link": "https://economictimes.indiatimes.com/markets/stocks/news/hdfc-bank-shares-in-focus-as-rbi-approves-up-to-9-5-stake-acquisition-in-indusind-bank-by-group-entities/articleshow/125993596.cms", "published": "2025-12-16T07:55:51+00:00", "summary": "HDFC Bank's group entities have received RBI approval to acquire up to 9.50% in IndusInd Bank. The approval, valid until December 14, 2026, covers entities like HDFC Mutual Fund and HDFC Life Insurance. This precautionary measure was taken due to potential aggregate shareholding exceeding regulatory thresholds.", "source": "https://economictimes.indiatimes.com/markets/stocks/rssfeeds/2146843.cms"}
{"title": "Tata Power shares in focus as co targets Rs 25,000 crore annual capex through FY30", "link": "https://economictimes.indiatimes.com/markets/stocks/news/tata-power-shares-in-focus-as-co-targets-rs-25000-crore-annual-capex-through-fy30/articleshow/125993584.cms", "published": "2025-12-16T07:53:19+00:00", "summary": "Tata Power plans a substantial Rs 25,000 crore investment this fiscal year.  A significant portion will fund clean energy projects.  The company aims to double its renewable capacity and expand its customer base.  New licenses are being sought in various states.  This strategic move signals a major growth phase for Tata Power.", "source": "https://economictimes.indiatimes.com/markets/stocks/rssfeeds/2146843.cms"}
{"title": "Stocks to buy for 2026: Adani Ports, JSW Infrastructure among top 5 stocks that could deliver 10-30% return", "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-to-buy-for-2026-adani-ports-jsw-infrastructure-among-top-5-stocks-that-could-deliver-10-30-return/slideshow/125993569.cms", "published": "2025-12-16T07:47:37+00:00", "summary": "We have collated a list of recommendations from top brokerage firms from ETNow and other sources.", "source": "https://economictimes.indiatimes.com/markets/stocks/rssfeeds/2146843.cms"}
{"title": "Positive Breakout: These 7 stocks cross above their 200 DMAs", "link": "https://economictimes.indiatimes.com/markets/stocks/news/positive-breakout-these-7-stocks-cross-above-their-200-dmas/slideshow/125993533.cms", "published": "2025-12-16T07:43:19+00:00", "summary": "As long as the stock is priced above the 200-day SMA on the daily timeframe, it is generally considered to be in an overall uptrend.", "source": "https://economictimes.indiatimes.com/markets/stocks/rssfeeds/2146843.cms"}
{"title": "Wall Street closes lower as investors position for busy week of data", "link": "https://economictimes.indiatimes.com/markets/stocks/news/wall-street-closes-lower-as-investors-position-for-busy-week-of-data/articleshow/125993340.cms", "published": "2025-12-16T07:21:22+00:00", "summary": "Wall Street closed lower as investors awaited key economic data, including jobs and inflation reports, for clues on the interest rate outlook.  Market participants are also assessing Federal Reserve candidate speculation and recent policymaker commentary.  Major indices experienced declines, with healthcare stocks leading gains while technology lagged.", "source": "https://economictimes.indiatimes.com/markets/stocks/rssfeeds/2146843.cms"}
{"title": "GIFT Nifty down 40 points; here's the trading setup for today's session", "link": "https://economictimes.indiatimes.com/markets/stocks/news/pre-market-action-heres-the-trade-setup-for-todays-session/articleshow/125993157.cms", "published": "2025-12-16T06:38:11+00:00", "summary": "Indian equity markets closed marginally lower on Monday, recovering from early losses amidst a weak global risk environment. Analysts anticipate a consolidation phase with heightened volatility as year-end approaches, influenced by thin volumes and an uncertain global macro backdrop.", "source": "https://economictimes.indiatimes.com/markets/stocks/rssfeeds/2146843.cms"}
{"title": "Stocks in news: RBL Bank, Hyundai India, SBI, Zydus Life, Delhivery", "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-in-news-rbl-bank-hyundai-india-sbi-zydus-life-delhivery/articleshow/125993137.cms", "published": "2025-12-16T06:33:17+00:00", "summary": "Markets ended nearly unchanged amid volatility, with rupee weakness and mixed global cues dictating direction. Rotational strength in heavyweight stocks provided support. Key companies like Tata Power, Hyundai India, RBL Bank, SBI, Zydus Life, and Delhivery are in focus due to significant news developments.", "source": "https://economictimes.indiatimes.com/markets/stocks/rssfeeds/2146843.cms"}
{"title": "ICICI Prudential AMC IPO: Issue booked 39 times on Day 03; NII, QIB portions see huge demand, GMP signals 14% premium", "link": "https://www.livemint.com/market/icici-prudential-amc-ipo-issue-booked-39-times-on-day-03-nii-qib-portions-see-huge-demand-gmp-signals-14-premium-11765887048598.html", "published": "2025-12-16T18:19:19+00:00", "summary": "ICICI Prudential AMC's IPO received a strong response, with a subscription rate of 39.17 times during its three-day bidding. The issue, valued at  ₹10,602.65 crore, attracted bids for 137 crore shares. Shares are expected to list on December 19.", "source": "https://www.livemint.com/rss/markets"}
{"title": "Crude oil drops below $60 on optimism over Russia-Ukraine peace deal, China’s weak factory data", "link": "https://www.livemint.com/market/commodities/crude-oil-drops-below-60-on-optimism-over-russia-ukraine-peace-deal-china-s-weak-factory-data-11765887690567.html", "published": "2025-12-16T18:06:59+00:00", "summary": "At 1023 GMT, Brent crude futures fell 1.8% to $59.45 a barrel. US West Texas Intermediate crude saw a similar drop, trading nearly 2% lower at $55.71 a barrel", "source": "https://www.livemint.com/rss/markets"}
{"title": "Nifty 50 outlook: Index likely to slide toward 25,700 in short term, warn analysts", "link": "https://www.livemint.com/market/stock-market-news/nifty-50-outlook-index-likely-to-slide-toward-25-700-in-short-term-warn-analysts-11765885352965.html", "published": "2025-12-16T18:06:44+00:00", "summary": "The Indian equity market saw a decline on December 16, with the Nifty 50 dropping to 25,860, pressured by a plummeting rupee and continued foreign selling. Analysts warn of potential further downside unless the index can reclaim key resistance levels.", "source": "https://www.livemint.com/rss/markets"}
{"title": "Earnings outlook improving; some IT stocks look attractive now, says Radhavi Deshpande of Kotak Mahindra Life Insurance", "link": "https://www.livemint.com/market/stock-market-news/earnings-outlook-improving-some-it-stocks-look-attractive-now-says-radhavi-deshpande-of-kotak-mahindra-life-insurance-11765886679604.html", "published": "2025-12-16T17:59:08+00:00", "summary": "Radhavi Deshpande of Kotak Mahindra Life Insurance believes mid and small-cap stocks may perform well over 2-5 years as earnings momentum improves. She sees conditions turning more supportive after two years of relatively muted earnings.", "source": "https://www.livemint.com/rss/markets"}
{"title": "Multibagger Navratna PSU stock to be in focus after  ₹345 crore order book update — Details here", "link": "https://www.livemint.com/market/stock-market-news/multibagger-navratna-psu-stock-nbcc-to-be-in-focus-after-rs-345-crore-order-book-update-details-here-11765884748909.html", "published": "2025-12-16T17:48:33+00:00", "summary": "Multibagger Navratna PSU stock: NBCC India shares are set to be in focus of the stock market investors on Wednesday, 17 December 2025, after the company secured a  ₹345 crore order book update. Here's how the shares have performed over the years.&amp;nbsp;", "source": "https://www.livemint.com/rss/markets"}
{"title": "KSH International IPO off to a slow start, subscribed 15% on first day; GMP remains nil", "link": "https://www.livemint.com/market/ipo/ksh-international-ipo-off-to-a-slow-start-subscribed-15-on-first-day-gmp-remains-nil-11765885540717.html", "published": "2025-12-16T17:24:02+00:00", "summary": "KSH International IPO was subscribed 15% on the first day as it garnered bids for 19,95,084 shares as against 1,36,16,438 shares on offer.", "source": "https://www.livemint.com/rss/markets"}
{"title": "Rupee falls 23 paise to settle at fresh record low of 91.01 against US dollar", "link": "https://www.livemint.com/market/rupee-falls-23-paise-to-settle-at-fresh-record-low-of-91-01-against-us-dollar-11765884688353.html", "published": "2025-12-16T17:03:29+00:00", "summary": "According to forex traders, the rupee might even cross the 92 per dollar-mark this month.", "source": "https://www.livemint.com/rss/markets"}
{"title": "Stocks to buy for long term: Dharmesh Shah of ICICI Securities picks seven shares for 2026, sees Nifty 50 at 50K by 2030", "link": "https://www.livemint.com/market/stock-market-news/stocks-to-buy-for-long-term-dharmesh-shah-of-icici-securities-picks-seven-shares-for-2026-sees-nifty-50-at-50k-by-2030-11765883422282.html", "published": "2025-12-16T16:59:28+00:00", "summary": "Stocks to buy for long term: Dharmesh Shah of ICICI Securities recommends seven shares for 2026 — Bajaj Finserv, IOCL, LTIMindtree, Pidilite Industries, SRF, Can Fin Homes, Jamna Auto", "source": "https://www.livemint.com/rss/markets"}
{"title": "Top Gainers &amp; Losers on Dec 16: OLA, PB Fintech, Axis Bank, Eternal, Paytm, Bharat Dynamics among top losers", "link": "https://www.livemint.com/market/stock-market-news/top-gainers-losers-on-dec-16-ola-pb-fintech-axis-bank-eternal-paytm-bharat-dynamics-among-top-losers-11765878595303.html", "published": "2025-12-16T15:38:59+00:00", "summary": "The Indian stock market faced selling pressure on December 16, with key indices falling 0.60%. Concerns over the rupee's decline and foreign investor selling contributed to market jitters, while sectoral indices mostly closed lower. The rupee breached 91 against the dollar, marking a historic low.", "source": "https://www.livemint.com/rss/markets"}
{"title": "Gold rates today under pressure on Russia-Ukraine peace deal buzz. Is it the right time to buy gold in India?", "link": "https://www.livemint.com/market/commodities/usd-vs-inr-gold-rates-today-under-pressure-on-russia-ukraine-peace-buzz-is-it-the-right-time-to-buy-gold-in-india-11765878856001.html", "published": "2025-12-16T15:37:28+00:00", "summary": "Gold and silver rates experienced profit booking amid optimism for a Russia-Ukraine peace deal, say experts", "source": "https://www.livemint.com/rss/markets"}
{"title": "Sensex falls 500 points, investors lose over  ₹3 lakh crore in a day— 10 key highlights from Indian stock market today", "link": "https://www.livemint.com/market/stock-market-news/sensex-falls-500-points-investors-lose-about-4-lakh-crore-in-a-day-10-key-highlights-from-indian-stock-market-today-11765878306249.html", "published": "2025-12-16T15:32:28+00:00", "summary": "The Sensex closed the day with a loss of 534 points, or 0.63%, at 84,679.86, while the Nifty 50 settled at 25,860.10, down 167 points, or 0.64%. The BSE Midcap index fell 0.78% while the Smallcap index declined 0.69%.", "source": "https://www.livemint.com/rss/markets"}
{"title": "PI Industries’ struggles with key herbicide necessitate a plan B", "link": "https://www.livemint.com/market/mark-to-market/pi-industries-stock-falls-kumiai-guidance-cut-agrochemicals-11765875465669.html", "published": "2025-12-16T15:23:04+00:00", "summary": "A Japanese agrochemical giant that buys the herbicide pyroxasulfone from PI recently lowered its FY26 revenue and profit guidance. This will have a bearing on PI’s revenue visibility from the key product.", "source": "https://www.livemint.com/rss/markets"}
{"title": "USD vs INR: Rupee continues its falling streak. Can it plunge to 100/$ by end of FY26?", "link": "https://www.livemint.com/market/stock-market-news/inr-vs-usd-rupee-continues-its-falling-streak-can-it-plunge-to-100-by-end-of-fy26-11765869153975.html", "published": "2025-12-16T14:59:05+00:00", "summary": "V K Vijayakumar, Chief Investment Strategist, Geojit Investments Limited, said that normally when rupee depreciates the RBI will intervene to stabilise the currency by selling dollars.", "source": "https://www.livemint.com/rss/markets"}
{"title": "Vedanta share price jumps 4% as NCLT approves demerger plan", "link": "https://www.livemint.com/market/stock-market-news/vedanta-share-price-jumps-4-as-nclt-approves-demerger-plan-11765877084477.html", "published": "2025-12-16T14:56:23+00:00", "summary": "Vedanta shares rallied after the NCLT approved its demerger despite objections from the Ministry of Petroleum and Natural Gas. The stock settled over 3% higher.", "source": "https://www.livemint.com/rss/markets"}
{"title": "Stock to buy in short term: Axis Securities recommends this auto stock as its 'Pick of the Week'", "link": "https://www.livemint.com/market/stock-market-news/stock-to-buy-in-short-term-axis-securities-recommends-auto-stock-maruti-suzuki-share-as-its-pick-of-the-week-11765876142820.html", "published": "2025-12-16T14:44:49+00:00", "summary": "Maruti Suzuki's stock has surged 45% in the past year, with a Buy rating from Axis Securities and a target price of  ₹18,170, suggesting a 10% upside. The company aims for a 50% market share while focusing on customer-centric strategies and new product launches.", "source": "https://www.livemint.com/rss/markets"}
{"title": "Ashish Kacholia portfolio stock Zaggle Prepaid jumps 5% defying stock market weakness; here's why", "link": "https://www.livemint.com/market/stock-market-news/ashish-kacholia-portfolio-stock-zaggle-prepaid-jumps-5-defying-indian-stock-market-weakness-heres-why-11765874020470.html", "published": "2025-12-16T14:11:32+00:00", "summary": "Ashish Kacholia portfolio stock Zaggle Prepaid jumped as much as 5% in intraday trade on the BSE on Tuesday, December 16, despite weak stock market sentiment.", "source": "https://www.livemint.com/rss/markets"}
{"title": "Gujarat Kidney &amp; Super Speciality IPO: From date, price band to GMP — Here's all you need to know about upcoming IPO", "link": "https://www.livemint.com/market/ipo/gujarat-kidney-super-speciality-ipo-from-date-price-band-to-gmp-heres-all-you-need-to-know-about-upcoming-ipo-11765871388253.html", "published": "2025-12-16T13:59:20+00:00", "summary": "Gujarat Kidney &amp;amp; Super Speciality IPO price band has been fixed at  ₹108 to  ₹114 per share, with a face value of  ₹2 each. The  ₹250.8 crore IPO consists entirely of a fresh issue of 2.20 crore shares, with no offer-for-sale component.", "source": "https://www.livemint.com/rss/markets"}
{"title": "Zomato-parent Eternal shares fall over 5% on heavy volumes, biggest intraday drop in five months", "link": "https://www.livemint.com/market/stock-market-news/zomatoparent-eternal-shares-fall-over-5-on-heavy-volumes-biggest-intraday-drop-in-five-months-11765872367976.html", "published": "2025-12-16T13:49:09+00:00", "summary": "Eternal share price plunged 5.3% to  ₹282.65 on December 16, marking its worst intraday crash since July. Eternal’s share price has remained under pressure since reaching an all-time high of  ₹368 in October, and the fall was further extended in the following weeks.&amp;nbsp;", "source": "https://www.livemint.com/rss/markets"}
{"title": "Silver prices at record high: What would be the right time to book profits? Track these 2 signals", "link": "https://www.livemint.com/market/commodities/silver-prices-at-record-high-what-would-be-the-right-time-to-book-profits-track-these-2-signals-11765872476615.html", "published": "2025-12-16T13:43:29+00:00", "summary": "For the near to medium term, both gold and silver still have room to move higher, say analysts, supported by the weaker dollar, tight supply, expectation of further rate cuts and steady investment and industrial demand.", "source": "https://www.livemint.com/rss/markets"}
{"title": "ICICI Prudential AMC listing: How SBI, ICICI and HDFC groups have dominated India's financial services industry", "link": "https://www.livemint.com/market/how-icici-sbi-hdfc-groups-perform-on-stock-market-11765867259341.html", "published": "2025-12-16T13:35:19+00:00", "summary": "The public listing of ICICI Prudential AMC serves as a reminder that three conglomerates—SBI, HDFC, and ICICI groups—have dominated India’s financial sector since liberalization. It hasn't always been smooth sailing, though.", "source": "https://www.livemint.com/rss/markets"}
{"title": "Up 95% in YTD! Multibagger small-cap stock Krishival Foods share price jumps ahead of rights issue record date", "link": "https://www.livemint.com/market/stock-market-news/up-95-in-ytd-multibagger-small-cap-stock-krishival-foods-share-price-jumps-ahead-of-rights-issue-record-date-11765871169523.html", "published": "2025-12-16T13:24:54+00:00", "summary": "Krishival Foods shares rose 2.5% ahead of the  ₹100 crore rights issue record date on December 17, 2025. The company plans to issue 33,33,160 partly paid-up shares at  ₹300 each, opening the issue on December 26, 2025.", "source": "https://www.livemint.com/rss/markets"}
{"title": "Opportunity in crisis: How to navigate bear market cycles? Experts weigh in", "link": "https://www.livemint.com/market/stock-market-news/opportunity-in-crisis-how-to-navigate-bear-market-cycles-experts-weigh-in-11765869796869.html", "published": "2025-12-16T13:02:01+00:00", "summary": "History shows that market downturns are a natural part of the investing cycle. Those who stay patient and invest in strong assets at lower prices have often been rewarded with substantial gains over time.", "source": "https://www.livemint.com/rss/markets"}
{"title": "Expert view: Large-caps may generate 10–11% CAGR over the next 3–4 years, says Chander Bhatia of Seers Fund Management", "link": "https://www.livemint.com/market/stock-market-news/expert-view-large-caps-may-generate-10-11-cagr-over-next-3-4-years-midcaps-small-caps-may-outperform-11765869282052.html", "published": "2025-12-16T13:00:14+00:00", "summary": "Expert view on markets: Chander Bhatia of Seers Fund Management is positive about the Indian stock market. He believes large-caps may grow by 10-11% CAGR over the next 3-4 years, while mid-caps and small-caps may grow by 13–15% during the same period.", "source": "https://www.livemint.com/rss/markets"}
{"title": "USD vs INR: Gold, mutual funds to stock market — how weak rupee, delay in India-US trade deal affecting your portfolio?", "link": "https://www.livemint.com/market/stock-market-news/usd-vs-inr-gold-mutual-funds-to-stock-market-how-weak-rupee-delay-in-india-us-trade-deal-affecting-your-portfolio-11765868561907.html", "published": "2025-12-16T12:48:16+00:00", "summary": "USD vs INR: The Indian Rupee hit a new low of 91.19 against the USD, logging a 6% dip YTD", "source": "https://www.livemint.com/rss/markets"}
{"title": "Amber Enterprises’ near-term woes bring more focus on electronics delivery", "link": "https://www.livemint.com/market/mark-to-market/amber-enterprises-electronics-business-pcb-manufacturing-expansion-11765865545910.html", "published": "2025-12-16T12:47:01+00:00", "summary": "Amber Enterprises faces a transition year as RAC demand slows and margins come under pressure, with its long-term growth hinging on a successful pivot toward electronics.", "source": "https://www.livemint.com/rss/markets"}
{"title": "Stocks to buy for short term: Axis Securities recommends Vedanta, ICICI Pru, Ashok Leyland shares for up to 13% upside", "link": "https://www.livemint.com/market/stock-market-news/stocks-to-buy-for-short-term-axis-securities-recommends-vedanta-icici-pru-ashok-leyland-shares-for-up-to-13-upside-11765866255602.html", "published": "2025-12-16T12:33:01+00:00", "summary": "Stocks to buy for short term: Domestic brokerage firm Axis Securities has identified three stocks — Vedanta, ICICI Prudential Life Insurance Company, and Ashok Leyland — that could deliver returns of up to 13% over the next four weeks based on technical factors.", "source": "https://www.livemint.com/rss/markets"}
{"title": "Silver rate today overtakes crude oil price for first time since 1980: What’s driving this divergence? EXPLAINED", "link": "https://www.livemint.com/market/commodities/silver-rate-today-overtakes-crude-oil-price-for-first-time-since-1980-what-s-driving-this-divergence-explained-11765866725325.html", "published": "2025-12-16T12:19:29+00:00", "summary": "Silver's rise is fueled by monetary factors and industrial demand amidst supply shortages, contrasting with oil's decline due to oversupply and weak demand. Analysts predict silver may reach $100 per ounce, despite its historical volatility and potential for correction.", "source": "https://www.livemint.com/rss/markets"}
{"title": "Japan bonds drift ahead of US jobs data, BOJ policy meeting", "link": "https://www.livemint.com/market/bonds/japan-bonds-drift-ahead-of-us-jobs-data-boj-policy-meeting-11765866043012.html", "published": "2025-12-16T11:54:32+00:00", "summary": "Traders fully expect the BOJ to raise interest rates by a quarter point on Friday, putting most of the focus on Governor Kazuo Ueda's post-meeting news conference for clues on the path for policy in 2026.", "source": "https://www.livemint.com/rss/markets"}
{"title": "Pajson Agro India IPO allotment date in focus: Check steps to track status, latest GMP", "link": "https://www.livemint.com/market/ipo/pajson-agro-india-ipo-allotment-date-in-focus-check-steps-to-track-status-latest-gmp-11765865500406.html", "published": "2025-12-16T11:48:33+00:00", "summary": "Pajson Agro India IPO has witnessed a strong 6.50 times subscription for its maiden share sale, garnering 2,71,70,400 bids as against 41,79,600 shares on offer. The retail portion of the IPO was booked 3.85 times, the NII quota 6.86 times and the QIB segment 10.92 times.", "source": "https://www.livemint.com/rss/markets"}
{"title": "Praj Industries share price gains 18% in two sessions but heads for worst yearly drop in 16 years", "link": "https://www.livemint.com/market/stock-market-news/praj-industries-share-price-gains-18-in-two-sessions-but-heads-for-worst-yearly-drop-in-16-years-11765864189629.html", "published": "2025-12-16T11:37:26+00:00", "summary": "Praj Industries share price gained over 7% to  ₹357.80, marking an 18% gain over two days. Despite recent recovery, the stock is down 57.21% year-to-date, its steepest drop since 2008. Analysts see potential in the company's diversification efforts amid ongoing challenges in the BioEnergy segment.", "source": "https://www.livemint.com/rss/markets"}
{"title": "Over 1000% return in YTD! Multibagger stock hits upper circuit for seventh straight session", "link": "https://www.livemint.com/market/stock-market-news/over-1000-return-in-ytd-multibagger-stock-elitecon-international-hits-upper-circuit-for-seventh-straight-session-11765862956111.html", "published": "2025-12-16T11:26:17+00:00", "summary": "Elitecon International share price rises 5% to  ₹120.58, hits upper circuit for seventh session straight on Tuesday, December 16, after the company announced that it has secured a long-term supply contract from Yuvi International Trade FZE.", "source": "https://www.livemint.com/rss/markets"}
{"title": "Axis Bank share price crashes 4% today. What's ailing the private lender? Explained", "link": "https://www.livemint.com/market/stock-market-news/axis-bank-share-price-crashes-4-today-whats-ailing-the-private-lender-explained-11765863026573.html", "published": "2025-12-16T11:05:05+00:00", "summary": "Shares of Axis Bank, one of India’s largest private sector lenders, came under heavy selling pressure on Tuesday, December 16, after management commentary indicated that the recovery in net interest margins is likely to be delayed by two quarters.", "source": "https://www.livemint.com/rss/markets"}
{"title": "Up 5800% in 5 years, small-cap EV stock under  ₹50 jumps over 4% despite weakness on Dalal Street", "link": "https://www.livemint.com/market/stock-market-news/up-5800-in-5-years-small-cap-ev-stock-under-rs-50-mercury-ev-tech-share-jumps-over-3-despite-weakness-on-dalal-street-11765861966916.html", "published": "2025-12-16T10:54:30+00:00", "summary": "Mercury Ev-Tech shares rose over 4% on December 16, despite a broader market decline. The stock is down 55% in the past year but has surged 5,800% over five years. The company reported strong financial growth, with Q2FY26 net sales up 51% year-on-year.", "source": "https://www.livemint.com/rss/markets"}
{"title": "ICICI Prudential AMC IPO vs KSH International IPO: Which one to apply for? Check GMP, expert views", "link": "https://www.livemint.com/market/ipo/icici-prudential-amc-ipo-vs-ksh-international-ipo-which-one-to-apply-for-check-gmp-expert-views-11765861285216.html", "published": "2025-12-16T10:40:38+00:00", "summary": "With two IPOs underway on Dalal Street, investors are likely to be divided over which one to apply for. Based solely on the grey market trend, the market leader and one of the biggest offerings of the year, ICICI Prudential AMC IPO, has emerged as the preferred bet.", "source": "https://www.livemint.com/rss/markets"}
{"title": "HDFC Bank group gets RBI nod to acquire up to 9.5% stake in IndusInd Bank", "link": "https://www.livemint.com/market/stock-market-news/hdfc-bank-gets-rbi-nod-to-acquire-9-5-stake-in-indusind-bank-11765859667147.html", "published": "2025-12-16T10:38:04+00:00", "summary": "HDFC Bank emphasized that it does not plan to make a direct investment. The approval was sought because the cumulative holdings of its group companies were expected to exceed the previous regulatory cap of 5%.", "source": "https://www.livemint.com/rss/markets"}
{"title": "Karan Johar, Adar Poonawalla-owned Dharma Production acquires Cornerstone's stake in DCA — Here's what they plan to do", "link": "https://www.livemint.com/companies/news/karan-johar-adar-poonawalla-owned-dharma-production-acquires-cornerstones-stake-in-dca-heres-what-they-plan-to-do-11765880070538.html", "published": "2025-12-16T16:38:24+00:00", "summary": "Dharma Production, owned by Karan Johar and Adar Poonawalla, acquired Cornerstone's stake in Dharma Cornerstone Agency in an effort to expand the firm under a new name —Dharma Collab Artists Agency.&amp;nbsp;", "source": "https://www.livemint.com/rss/companies"}
{"title": "Jio Financial Services aims to be a constructive disruptor in India's financial services sector", "link": "https://www.livemint.com/companies/news/jio-financial-services-constructive-disruptor-india-11765858049983.html", "published": "2025-12-16T15:35:38+00:00", "summary": "Leveraging Jio’s brand, tech, and partnerships, the NBFC is seeking scale, personalization, and market expansion, even as it enters the sector late.", "source": "https://www.livemint.com/rss/companies"}
{"title": "Meesho CEO Vidit Aatrey joins billionaire club after shares jump 74% post IPO listing — Here's how much he is worth", "link": "https://www.livemint.com/companies/people/meesho-ceo-vidit-aatrey-joins-billionaire-club-after-shares-jump-74-post-ipo-listing-heres-how-much-he-is-worth-11765874863994.html", "published": "2025-12-16T15:16:10+00:00", "summary": "Meesho CEO Vidit Aatrey joined the billionaire club on Monday after shares jumped 74% post the company's IPO premium listing on the Indian stock market. Check how much his stake is worth now.", "source": "https://www.livemint.com/rss/companies"}
{"title": "Not Mark Zuckerberg, Tim Cook, Jensen Huang — This Indian-origin leader was the highest-paid tech CEO of 2025", "link": "https://www.livemint.com/companies/people/not-mark-zuckerberg-tim-cook-jensen-huang-this-indian-origin-leader-was-the-highest-paid-tech-ceo-of-2025-11765873878216.html", "published": "2025-12-16T15:05:30+00:00", "summary": "The highest-paid tech CEO of fiscal 2025 was Satya Nadella, who took home a fat paycheck of $96.5 million. This was his highest compensation since he became CEO more than a decade ago.", "source": "https://www.livemint.com/rss/companies"}
{"title": "‘Didn’t buy Warner Bros to harm value’, says Netflix co-CEO Ted Sarandos, assures they ‘will continue theatre releases’", "link": "https://www.livemint.com/companies/people/netflix-co-ceo-ted-sarandos-didnt-buy-warner-bros-harm-to-value-assure-continue-cinema-releases-theatrical-films-movies-11765859462487.html", "published": "2025-12-16T14:49:35+00:00", "summary": "Netflix chief Ted Sarandos assured that the company will continue cinema releases for Warner Bros movies. Days prior, in a letter to staff, Sarandos and co-CEO Greg Peters affirmed they will continue theatrical releases for Warner Bros films.", "source": "https://www.livemint.com/rss/companies"}
{"title": "Highest paid CEO of 2025: This CEO takes top spot with 13-figure $1 trillion pay package in focus", "link": "https://www.livemint.com/companies/people/highest-paid-ceo-2025-tesla-elon-musk-top-spot-13-figure-1-trillion-pay-package-trillionaire-tim-cook-satya-nadella-axon-11765872097770.html", "published": "2025-12-16T14:42:52+00:00", "summary": "Elon Musk could net a whopping $90 million annually after Tesla shareholders approved a massive 13-figure, $1 trillion payout, for the world's richest man.", "source": "https://www.livemint.com/rss/companies"}
{"title": "Vedanta wins approval for demerger plan from Mumbai NCLT, overcomes petroleum ministry's objections", "link": "https://www.livemint.com/companies/vedanta-demerger-plan-mumbai-nclt-petroleum-ministry-objections-hydrocarbons-disclosures-11765865019112.html", "published": "2025-12-16T14:42:43+00:00", "summary": "The petroleum ministry’s opposition has been the biggest hurdle in getting approval from the NCLT for Vedanta's restructuring plan.", "source": "https://www.livemint.com/rss/companies"}
{"title": "Delhi HC defers Apple challenge to CCI’s global turnover penalty rules to January", "link": "https://www.livemint.com/companies/news/delhi-hc-apple-cci-global-turnover-penalty-challenge-11765868748433.html", "published": "2025-12-16T13:05:37+00:00", "summary": "The court will hear Apple’s plea against India’s revised competition law in January 2026, a case that could shape how Big Tech is fined under the new CCI framework", "source": "https://www.livemint.com/rss/companies"}
{"title": "upGrad begins IPO preparations for a $350–400 million 2027 listing", "link": "https://www.livemint.com/companies/news/upgrad-ipo-2027-listing-byjus-unacademy-deal-india-edtech-11765853986799.html", "published": "2025-12-16T10:42:09+00:00", "summary": "The Temasek-backed company is pursuing acquisitions, including parts of Byju’s and a possible Unacademy deal, as it resets its business ahead of a public listing.", "source": "https://www.livemint.com/rss/companies"}
{"title": "Concentric scale-ups: Mid-tier hospitals make expansion bets as large rivals consolidate", "link": "https://www.livemint.com/companies/news/india-mid-tier-hospital-chains-expand-consolidation-looms-11765792494248.html", "published": "2025-12-16T10:35:35+00:00", "summary": "These chains are exploring largely greenfield opportunities and expansion in existing facilities, funded by internal accruals and debt. The trend is driven by increasing demand for private healthcare and growing insurance penetration—and, consolidation ahead in the sector.", "source": "https://www.livemint.com/rss/companies"}
{"title": "Wingreens Farms seeks  ₹200 crore as turnaround gains traction", "link": "https://www.livemint.com/companies/start-ups/wingreens-farms-200-crore-fundraise-jm-financial-11765853031996.html", "published": "2025-12-16T10:24:02+00:00", "summary": "Wingreens Farms has appointed JM Financial to raise up to  ₹200 crore as it sharpens unit economics, narrows losses and works towards a potential IPO over the next 2–3 years.", "source": "https://www.livemint.com/rss/companies"}
{"title": "Elon Musk's net worth tops $600 billion! How did the SpaceX CEO increase his wealth by $168 billion in a day?", "link": "https://www.livemint.com/companies/people/elon-musks-net-worth-tops-600-billion-how-did-the-spacex-ceo-increase-his-wealth-by-168-billion-in-a-day-11765853348872.html", "published": "2025-12-16T09:25:14+00:00", "summary": "Musk's huge stake at the rocket company would thus strengthen his net worth by a whopping $168 billion to an estimated $677 billion as of 12 pm ET on Monday, according to Forbes.", "source": "https://www.livemint.com/rss/companies"}
{"title": "With a 'fresher' drive to the EV road, Maruti looks to do what it knows best", "link": "https://www.livemint.com/companies/news/electric-vehicles-ev-maruti-suzuki-evitara-debut-commercial-launch-charging-infra-trained-technicians-low-resale-value-11765798611030.html", "published": "2025-12-16T06:00:36+00:00", "summary": "Maruti Suzuki's debut EV model eVitara is likely to be commercially launched in the January-March quarter, with bookings slated to open soon.", "source": "https://www.livemint.com/rss/companies"}
{"title": "Ford Expects To Record About $19.5 Bln In Special Items With Majority In Q4", "link": "https://www.livemint.com/companies/news/ford-expects-to-record-about-19-5-bln-in-special-items-with-majority-in-q4-11765841154435.html", "published": "2025-12-16T04:55:54+00:00", "summary": "BRIEF-Ford Expects To Record About $19.5 Bln In Special Items Wi:BRIEF-Ford Expects To Record About $19.5 Bln In Special Items With Majority In Q4", "source": "https://www.livemint.com/rss/companies"}
{"title": "Big retailers didnt pull ByHeart baby formula fast enough after botulism recall, FDA says", "link": "https://www.livemint.com/companies/news/big-retailers-didnt-pull-byheart-baby-formula-fast-enough-after-botulism-recall-fda-says-11765837650100.html", "published": "2025-12-16T03:57:29+00:00", "summary": "Big retailers didn't pull ByHeart baby formula fast enough after botulism recall, FDA says", "source": "https://www.livemint.com/rss/companies"}
{"title": "Ford to take $19.5 billion hit, scrap planned electric cars in strategy pivot amid Trump's policies", "link": "https://www.livemint.com/companies/news/ford-to-take-19-5-billion-hit-scrap-planned-electric-cars-in-strategy-pivot-amid-trumps-policies-11765834365763.html", "published": "2025-12-16T03:20:48+00:00", "summary": "Marking a departure from purely electric vehicles, Ford said that it would now focus on gas and electric hybrids, and projected generating thousands of jobs eventually as a result of the pivot. The move comes amid dipping EV sales as the Trump admin pulls federal support for a transition.", "source": "https://www.livemint.com/rss/companies"}
{"title": "Purse pirates: UPS ripped off seasonal workers with unfair pay practices, lawsuit alleges", "link": "https://www.livemint.com/companies/news/purse-pirates-ups-ripped-off-seasonal-workers-with-unfair-pay-practices-lawsuit-alleges-11765829099638.html", "published": "2025-12-16T01:34:59+00:00", "summary": "Purse pirates: UPS ripped off seasonal workers with unfair pay practices, lawsuit alleges", "source": "https://www.livemint.com/rss/companies"}
{"title": "Why Walmart-backed Flipkart is finally moving its headquarters to India", "link": "https://www.livemint.com/companies/with-nclt-nod-flipkart-moves-closer-to-indian-residency-11765791394562.html", "published": "2025-12-15T22:27:42+00:00", "summary": "Flipkart's transition from Singapore to India has been approved by the NCLT, reflecting a shift in India-US economic relations. The move aims to enhance regulatory alignment and prepare for a possible public listing, pending a final government clearance.", "source": "https://www.livemint.com/rss/companies"}
{"title": "Netflix CEOs defend Warner Bros deal: What they say on Paramount bid, job loss fears, theatrical release and more", "link": "https://www.livemint.com/companies/news/netflix-ceos-defend-warner-bros-deal-what-they-say-on-paramount-bid-job-loss-fears-theatrical-release-and-more-11765812194548.html", "published": "2025-12-15T22:13:26+00:00", "summary": "Netflix executives addressed concerns over their $82.7 billion acquisition of Warner Bros Discovery after a rival bid from Paramount.", "source": "https://www.livemint.com/rss/companies"}
{"title": "Snabbit in talks to raise $100-120 million amid home services boom", "link": "https://www.livemint.com/companies/news/snabbit-startup-funding-round-india-home-services-market-growth-valuation-11765790307168.html", "published": "2025-12-15T17:05:30+00:00", "summary": "The company has so far raised $56 million in total funding and counts Lightspeed, Elevation Capital and Nexus Venture Partners among its investors. With this, Snabbit is heading into its fifth funding round since being founded last year.", "source": "https://www.livemint.com/rss/companies"}
{"title": "CityMall’s small-basket gamble: Can no-frills ecommerce crack Bharat?", "link": "https://www.livemint.com/companies/citymall-small-town-ecommerce-bharat-grocery-model-challenges-11765797086729.html", "published": "2025-12-15T16:59:21+00:00", "summary": "CityMall is taking on one of the toughest e-commerce challenges in India: winning small-town shoppers on wafer-thin margins. It has backers with deep pockets, a stripped-down supply chain and big ambitions. But it is yet to crack the market and build scale.", "source": "https://www.livemint.com/rss/companies"}
{"title": "WhatsApp must take user consent for all data uses, not just ads: NCLAT", "link": "https://www.livemint.com/companies/news/whatsapp-user-consent-whatsapp-privacy-policy-2021-11765785677124.html", "published": "2025-12-15T15:28:44+00:00", "summary": "The tribunal made it clear that user consent is mandatory for all the data that WhatsApp collects and shares with Meta, not just data used for advertising.", "source": "https://www.livemint.com/rss/companies"}
{"title": "JioStar appoints financial leader GR Arun Kumar as new CFO, amid push for accelerated decision-making", "link": "https://www.livemint.com/companies/people/jiostar-appoints-financial-leader-gr-arun-kumar-as-new-cfo-amid-push-for-accelerated-decisionmaking-11765788653589.html", "published": "2025-12-15T14:48:56+00:00", "summary": "JioStar has appointed GR Arun Kumar as its new CFO, amid a push for accelerated decision making across markets. He will lead the streaming giant's overall Finance and Commercial functions.", "source": "https://www.livemint.com/rss/companies"}
{"title": "Who is Jimmy Lai? Hong Kong media tycoon convicted for sedition, collusion with foreign forces", "link": "https://www.livemint.com/companies/people/jimmy-lai-who-supports-democracy-hong-kong-media-tycoon-arrest-china-critic-convicted-sedition-collusion-foreign-forces-11765781327768.html", "published": "2025-12-15T13:59:03+00:00", "summary": "Hong Kong media tycoon Jimmy Lai has been arrested and convicted for sedition and collusion with foreign forces. We take a look at who he is — known as a strong voice for democracy in Hong Kong by like-minded parties, while opponents call the tabloid owner a traitor to “motherland” China.&amp;nbsp;", "source": "https://www.livemint.com/rss/companies"}
{"title": "‘Acquisitions are only a top-up, organic growth drives us’: Vineet Agrawal of Wipro Consumer Care", "link": "https://www.livemint.com/companies/acquisitions-organic-growth-vineet-agrawal-of-wipro-consumer-care-fmcg-packaged-food-interview-11765448073538.html", "published": "2025-12-15T12:38:41+00:00", "summary": "In a conversation with Mint, Vineet Agrawal, CEO of Wipro Consumer Care, reflects on four decades in FMCG, India’s low category penetration and why multi-category growth is key to scaling.", "source": "https://www.livemint.com/rss/companies"}
{"title": "Hedge Fund Boom Pushes Dubai Finance Hub Past the 100-Firm Mark", "link": "https://www.livemint.com/companies/news/hedge-fund-boom-pushes-dubai-finance-hub-past-the-100-firm-mark-11765779818512.html", "published": "2025-12-15T11:53:37+00:00", "summary": "The number of hedge funds registered in Dubai’s financial hub has doubled since the start of last year to more than 100, underscoring the city’s rapid rise as an emerging global hub for the industry.", "source": "https://www.livemint.com/rss/companies"}
{"title": "Old meets new economy: AI boom to supercharge European banks rally", "link": "https://www.livemint.com/companies/news/old-meets-new-economy-ai-boom-to-supercharge-european-banks-rally-11765774876566.html", "published": "2025-12-15T10:31:15+00:00", "summary": "EUROPEANBANKS-AI/ (ANALYSIS, PIX):ANALYSIS-Old meets new economy: AI boom to supercharge European banks' rally", "source": "https://www.livemint.com/rss/companies"}
{"title": "‘Some flights may be proactively cancelled’: IndiGo issues advisory amid dense fog, low visibility in Delhi", "link": "https://www.livemint.com/companies/news/indigo-issues-passenger-travel-advisory-delayed-cancelled-flights-weather-impact-dense-fog-low-visibility-delhi-safety-11765773440849.html", "published": "2025-12-15T10:15:42+00:00", "summary": "IndiGo airlines has issued a travel advisory for passengers, noting that dense fog and reduced visibility in Delhi have impacted flight operations on 15 December. The airline added that some flights may be proactively cancelled ensure passenger safety.", "source": "https://www.livemint.com/rss/companies"}
{"title": "China Shadow Bank’s Missed Payments Show Growing Property Stress", "link": "https://www.livemint.com/companies/news/china-shadow-bank-s-missed-payments-show-growing-property-stress-11765770743322.html", "published": "2025-12-15T09:22:22+00:00", "summary": "A $3 billion redemption crisis in eastern China is reviving concerns about the loosely-regulated shadow-banking industry as the nation’s prolonged property slump risks spilling over into the financial sector.", "source": "https://www.livemint.com/rss/companies"}
{"title": "Solar companies making big profits now, but earnings may slow in next 3 years: DAM Capital", "link": "https://www.livemint.com/companies/news/solar-companies-making-big-profits-now-but-earnings-may-slow-in-next-3-years-dam-capital-11765767415478.html", "published": "2025-12-15T08:26:54+00:00", "summary": "Indian solar companies are earning very high profits right now, but these profits are expected to slow down in the coming years as more factories open and competition increases, according to a report by DAM Capital.", "source": "https://www.livemint.com/rss/companies"}
{"title": "ServiceNow in advanced talks to acquire cybersecurity startup Armis for upto $7 billion, says report", "link": "https://www.livemint.com/companies/news/servicenow-advance-talks-acquire-buy-armis-deal-value-7-billion-cybersecurity-startup-israel-veteran-tech-company-report-11765759279322.html", "published": "2025-12-15T06:48:26+00:00", "summary": "ServiceNow is in advanced talks to buy Israeli military veteran-run Armis for up to $7 billion, its largest acquisition. The deal may be announced soon, or could collapse if another potential buyer emerges for the &amp;nbsp;cybersecurity startup.&amp;nbsp;", "source": "https://www.livemint.com/rss/companies"}
{"title": "'India's diversity to bring Meesho-like outcomes across sectors': Prosus' Sharma", "link": "https://www.livemint.com/companies/prosus-india-investments-meesho-ipo-listing-gains-ai-fintech-strategy-11765462339139.html", "published": "2025-12-15T06:00:58+00:00", "summary": "Even as it is ready to harvest, Prosus has been busy deploying capital in the country. Earlier in August it pumped in $146 million in Ixigo, a listed new-age travel services company, a first for the firm. This calendar year alone, the firm has deployed around $560 million in India.", "source": "https://www.livemint.com/rss/companies"}
{"title": "Madhusudan Kela urges focus on fundamentals as OFS dominates IPOs", "link": "https://www.livemint.com/companies/news/as-ofs-heavy-ipos-surge-madhusudan-kela-lays-down-his-investing-rule-11765694038746.html", "published": "2025-12-15T06:00:38+00:00", "summary": "Ace investor Madhusudan Kela emphasized that exits are not a concern if the company does not require fresh capital, and the public issue is attractively priced.", "source": "https://www.livemint.com/rss/companies"}
{"title": "Robot Vacuum Roomba Maker Files for Bankruptcy After 35 Years", "link": "https://www.livemint.com/companies/news/robot-vacuum-roomba-maker-files-for-bankruptcy-after-35-years-11765758429853.html", "published": "2025-12-15T05:57:09+00:00", "summary": "iRobot Corp. filed for bankruptcy after reaching a restructuring support agreement that will hand control of the consumer robot maker to Shenzhen PICEA Robotics Co., its main supplier and lender, and Santrum Hong Kong Co.", "source": "https://www.livemint.com/rss/companies"}
{"title": "Why older Indians are finding a second career as influencers", "link": "https://www.livemint.com/companies/older-indians-make-turn-content-creators-in-their-second-careers-11765688563977.html", "published": "2025-12-15T05:35:57+00:00", "summary": "With retirement secured and pressure lower, professionals in their 40s, 50s and 60s are turning to content creation for income, fulfilment and freedom.", "source": "https://www.livemint.com/rss/companies"}
{"title": "Personal loan eligibility: What is the minimum income required?", "link": "https://www.livemint.com/money/personal-finance/personal-loan-eligibility-what-is-the-minimum-income-required-11765868852886.html", "published": "2025-12-16T15:43:28+00:00", "summary": "The minimum income requirement is an important eligibility criterion for a personal loan. The applicant’s income helps the bank assess the applicant’s repayment capacity and ability to make timely EMI payments.", "source": "https://www.livemint.com/rss/money"}
{"title": "One nation, one portfolio: How AI biases could leave us all holding the same bag", "link": "https://www.livemint.com/money/personal-finance/ai-investing-tools-ai-in-investing-11765864211392.html", "published": "2025-12-16T14:28:17+00:00", "summary": "Generative AI is quietly reinforcing one of our most persistent investing biases – familiarity – thanks to inherent disparities in training data. If we’re not careful, we could find ourselves with portfolios that look eerily similar, carry the same risks, and collapse in unison.", "source": "https://www.livemint.com/rss/money"}
{"title": "Mutual Funds: Want to accumulate  ₹50 lakh in next 12 years? You will need SIP of this amount", "link": "https://www.livemint.com/money/personal-finance/mutual-funds-want-to-accumulate-rs-50-lakh-in-next-12-years-you-will-need-sip-of-this-amount-11765797999099.html", "published": "2025-12-16T10:47:46+00:00", "summary": "The amount of SIP is contingent on the rate of return on your investment. Higher the return, lower the SIP needed. Conversely, lower the return, higher the need for SIP.", "source": "https://www.livemint.com/rss/money"}
{"title": "Debt investments that still make sense in a falling rate cycle", "link": "https://www.livemint.com/money/personal-finance/fixed-income-portfolio-strategy-tax-efficient-alternatives-high-returns-11765794483467.html", "published": "2025-12-16T07:00:58+00:00", "summary": "With RBI cutting the repo rate by 125 bps in 2025, bank FD rates have fallen across tenures. While FDs still suit low-tax investors, options like PPF, SCSS, arbitrage funds and income-plus FoFs offer better post-tax returns for short- and long-term goals.", "source": "https://www.livemint.com/rss/money"}
{"title": "Advance tax deadline today: What happens if you miss the 15 December payment? What's the penalty?", "link": "https://www.livemint.com/money/personal-finance/advance-tax-deadline-today-what-happens-if-you-miss-the-15-december-payment-whats-the-penalty-11765794831955.html", "published": "2025-12-15T22:35:47+00:00", "summary": "The third advance tax instalment for FY 2025-26 is due on 15 December 2025. Taxpayers with a liability over  ₹10,000 must pay on time to avoid interest. Here's everything you need to know about the rules in case you miss the deadline.", "source": "https://www.livemint.com/rss/money"}
{"title": "NPS: These fund managers delivered highest returns on equity investment in past 3 years. See list", "link": "https://www.livemint.com/money/personal-finance/nps-these-fund-managers-delivered-highest-return-on-equity-assets-in-past-3-years-see-list-11765805987021.html", "published": "2025-12-15T21:13:52+00:00", "summary": "National Pension System subscribers can choose their fund managers – each of which has a unique portfolio of assets based on their investing philosophy.&amp;nbsp;", "source": "https://www.livemint.com/rss/money"}
{"title": "Baap of Charts crackdown: Sebi starts proceedings against this finfluencer to recover over  ₹17 crore", "link": "https://www.livemint.com/money/personal-finance/sebi-starts-proceedings-against-this-finfluencer-to-recover-over-rs-17-crore-11765803907471.html", "published": "2025-12-15T19:41:49+00:00", "summary": "Sebi launched a crackdown on Ansari and his firm in 2023 when he was banned from trading in the securities market", "source": "https://www.livemint.com/rss/money"}
{"title": "From Europe to the Maldives: How a weak rupee is rewriting travel budgets", "link": "https://www.livemint.com/money/personal-finance/rupee-at-90-holiday-to-europe-maldives-and-parts-of-southeast-asia-cost-more-dollar-weakening-currency-rbi-11765778316221.html", "published": "2025-12-15T15:46:58+00:00", "summary": "The rupee’s slide past  ₹90 to the dollar is making overseas travel costlier—not just to the US, but across Europe, the Maldives and parts of Asia, with uneven impact by destination.", "source": "https://www.livemint.com/rss/money"}
{"title": "One year can change a lot: Why your financial goals and investments need a reset", "link": "https://www.livemint.com/money/personal-finance/one-year-can-change-a-lot-why-your-financial-goals-and-investments-need-a-reset-sip-mutual-funds-insurance-11765793262312.html", "published": "2025-12-15T15:45:57+00:00", "summary": "As the year ends, it's crucial to review financial goals and investments. Changes in personal circumstances or income levels can necessitate adjustments to financial plans and insurance needs, ensuring optimal asset allocation and adequate coverage for future expenses.", "source": "https://www.livemint.com/rss/money"}
{"title": "The real reason generational wealth fails—and how intelligent advisory can fix it", "link": "https://www.livemint.com/money/personal-finance/generational-wealth-intelligent-advisory-family-financial-planning-india-market-volatility-investment-financial-acumen-11765782268096.html", "published": "2025-12-15T14:52:20+00:00", "summary": "Global data shows money fades not due to markets, but missing financial wisdom. Intelligent advisory aims to bridge that gap.", "source": "https://www.livemint.com/rss/money"}
{"title": "Year-end credit checklist: 5 smart moves to strengthen your credit before 2026", "link": "https://www.livemint.com/money/personal-finance/yearend-credit-checklist-5-smart-moves-to-strengthen-your-credit-before-2026-credit-score-loans-11765782607128.html", "published": "2025-12-15T12:55:44+00:00", "summary": "Regularly monitor your credit score, balance credit with investments, ensure timely EMI repayments, and avoid over-leverage to strengthen your financial health for a stress-free new year.", "source": "https://www.livemint.com/rss/money"}
{"title": "Thinking of closing a credit card? Here’s how it impacts your credit score", "link": "https://www.livemint.com/money/personal-finance/thinking-of-closing-a-credit-card-here-s-how-it-impacts-your-credit-score-11765779523799.html", "published": "2025-12-15T12:00:45+00:00", "summary": "A credit card closure can alter the credit mix, reduce credit ageing, increase the credit utilisation ratio, or halt the progress in building a credit score and history. These can result in a marginal fall in the credit score.&amp;nbsp;", "source": "https://www.livemint.com/rss/money"}
{"title": "India must stop reinventing the regulatory wheel when it comes to educating investors", "link": "https://www.livemint.com/money/finfluencer-securities-market-financial-literacy-avadhut-sathe-social-media-sebi-youth-focused-push-11765731226346.html", "published": "2025-12-15T11:59:44+00:00", "summary": "India's finfluencer crackdown reveals gaps in the digital-finance ecosystem, where unregulated advice thrives. Learning from global regulations, India can enhance transparency and accountability to protect young investors with low financial literacy.", "source": "https://www.livemint.com/rss/money"}
{"title": "Chasing quick returns, investors sacrifice their own financial security", "link": "https://www.livemint.com/money/personal-finance/chasing-quick-returns-investors-sacrifice-their-own-financial-security-11765706508283.html", "published": "2025-12-14T18:40:28+00:00", "summary": "The ancient tale of Bhasmasura serves as a perfect metaphor for modern retail investors who, in their impatience for quick wealth, progressively sacrifice fundamental financial security for high-risk, high-leverage instruments.", "source": "https://www.livemint.com/rss/money"}
{"title": "ITR advance tax deadline 2025: Key dates to step-by-step guide to pay — All you need to know before 15 December due date", "link": "https://www.livemint.com/money/personal-finance/itr-advance-tax-deadline-2025-key-dates-to-step-by-step-guide-to-pay-all-you-need-to-know-before-15-december-due-date-11765712277892.html", "published": "2025-12-14T18:33:49+00:00", "summary": "ITR advance tax deadline 2025: From Key dates, tax calculation to a step-by-step guide on how to pay the partial tax payment for the financial year. Here's all you need to know before the 15 December due date.", "source": "https://www.livemint.com/rss/money"}
{"title": "8th Pay Commission: Will pensioners get DA hikes under new Finance Act 2025? Govt clarifies", "link": "https://www.livemint.com/money/personal-finance/8th-pay-commission-will-pensioners-stop-getting-da-hikes-under-new-finance-act-2025-govt-clarifies-11765702270924.html", "published": "2025-12-14T15:14:51+00:00", "summary": "8th Pay Commission: Government issues clarification on whether the central government employees will get dearness allowances (DA) and pay commission revisions under the new Finance Act 2025. Here's what you need to know.", "source": "https://www.livemint.com/rss/money"}
{"title": "8th pay commission: Railways plans cost-cutting to deal with higher wages, says report", "link": "https://www.livemint.com/money/personal-finance/8th-pay-commission-railways-implements-cost-cutting-to-deal-with-higher-wages-says-report-11765680907601.html", "published": "2025-12-14T08:30:17+00:00", "summary": "The 8th Central Pay Commission, established in January 2024, will review pay, allowances and pensions of central government employees.", "source": "https://www.livemint.com/rss/money"}
{"title": "AI has taken over Wall Street. Should it take over your portfolio too?", "link": "https://www.livemint.com/money/personal-finance/ai-wall-street-boom-indian-investors-portfolio-diversification-global-markets-11765474442914.html", "published": "2025-12-14T07:01:13+00:00", "summary": "For Indian investors, the implications of the US rally are different from those for American investors.", "source": "https://www.livemint.com/rss/money"}
{"title": "Income Tax dept cracks down on bogus claims linked to donations, SMS and emails sent to taxpayers as ‘friendly measure’", "link": "https://www.livemint.com/money/income-tax-dept-cracks-down-on-bogus-claims-linked-to-donations-sms-and-emails-sent-to-taxpayers-as-friendly-measure-11765628946657.html", "published": "2025-12-13T19:24:58+00:00", "summary": "The Income Tax department is alerting taxpayers via SMS and email to update their returns and withdraw incorrect claims, following a crackdown on fraudulent tax claims linked to Registered Unrecognised Political Parties (RUPPs) or charitable institutions.", "source": "https://www.livemint.com/rss/money"}
{"title": "SBI revises term deposit rates, reduces lending rates — check details", "link": "https://www.livemint.com/money/personal-finance/sbi-revises-term-deposit-rates-reduces-lending-rates-check-details-11765559952701.html", "published": "2025-12-13T00:10:06+00:00", "summary": "The State Bank of India has revised interest rates for term deposits and reduced MCLR and EBLR rates following a repo rate cut by the RBI. Interest rates for senior citizens and the general public on various tenures have been revised, effective from December 15, 2025.", "source": "https://www.livemint.com/rss/money"}
{"title": "New Labour Codes: Will it slash your take-home salary? Govt clarifies amid PF deduction concerns", "link": "https://www.livemint.com/money/personal-finance/new-labour-codes-will-it-slash-your-take-home-salary-govt-clarifies-amid-pf-deduction-concerns-11765544940976.html", "published": "2025-12-12T21:00:30+00:00", "summary": "The Ministry of Labour stated that the new Labour Codes will not decrease take-home pay as PF deductions are based on a  ₹15,000 ceiling.&amp;nbsp;", "source": "https://www.livemint.com/rss/money"}
{"title": "Understanding how asset management companies invest your mutual fund money for smarter wealth creation", "link": "https://www.livemint.com/money/personal-finance/understanding-how-asset-management-companies-invest-your-mutual-fund-money-for-smarter-wealth-creation-11765539496286.html", "published": "2025-12-12T17:56:33+00:00", "summary": "An Asset Management Company manages pooled investments through research-driven portfolios, transparent costs and regulatory oversight, helping investors access diversified mutual fund opportunities while understanding AMC functions, benefits and key considerations.", "source": "https://www.livemint.com/rss/money"}
{"title": "Even Warren Buffett is open to learning how to be a better investor", "link": "https://www.livemint.com/money/even-warren-buffett-is-open-to-learning-how-to-be-a-better-investor-11765541780897.html", "published": "2025-12-12T17:51:03+00:00", "summary": "Investors must evolve their thinking to adapt to constantly changing market environments, Douglas Eby writes in a guest commentary.", "source": "https://www.livemint.com/rss/money"}
{"title": "Understand the key differences between a credit report and credit score to strengthen your financial profile", "link": "https://www.livemint.com/money/personal-finance/understand-the-key-differences-between-a-credit-report-and-credit-score-to-strengthen-your-financial-profile-11765533657134.html", "published": "2025-12-12T16:16:46+00:00", "summary": "A clear overview of the differences between a credit report and credit score, highlighting their purpose, impact on borrowing, and why both are essential for maintaining a strong financial profile.", "source": "https://www.livemint.com/rss/money"}
{"title": "Check out how personal loan refinancing lowers EMIs, trims interest outgo and enhances financial control", "link": "https://www.livemint.com/money/personal-finance/check-out-how-personal-loan-refinancing-can-lower-emis-trim-interest-outgo-and-enhance-financial-control-11765528387135.html", "published": "2025-12-12T14:58:04+00:00", "summary": "Refinancing a personal loan can cut EMIs, lower interest costs and simplify repayments by securing better terms, helping borrowers improve cash flow and strengthen long-term financial stability.", "source": "https://www.livemint.com/rss/money"}
{"title": "Understanding key differences between overdraft and personal loan options for better financial planning", "link": "https://www.livemint.com/money/personal-finance/understanding-key-differences-between-overdraft-and-personal-loan-options-for-better-financial-planning-11765523416570.html", "published": "2025-12-12T13:25:50+00:00", "summary": "A clear comparison of overdraft vs personal loan outlining key differences, benefits and risks to help borrowers choose suitable credit options based on cash flow needs, costs and financial goals.", "source": "https://www.livemint.com/rss/money"}
{"title": "Retirement savings revamp: NPS now includes gold, silver ETFs", "link": "https://www.livemint.com/money/national-pension-system-gold-silver-etf-investment-retirement-savings-pfrda-11765443157864.html", "published": "2025-12-11T17:06:32+00:00", "summary": "PFRDA has allowed investments under the NPS into gold and silver ETFs and Nifty 250 stocks.", "source": "https://www.livemint.com/rss/money"}
{"title": "Why December 2025 is the best car-buying window - there's more to it than GST cuts", "link": "https://www.livemint.com/money/automotive-sector-gst-rate-cuts-year-end-stock-clearance-passenger-vehicle-sales-festive-sales-11765428324023.html", "published": "2025-12-11T14:43:40+00:00", "summary": "The Indian automotive sector is experiencing strong growth due to record festive sales and tax reforms. Year-end stock-clearances are expected to gain, with the GST cuts on small cars boosting affordability, leading to significant sales increases.", "source": "https://www.livemint.com/rss/money"}
{"title": "Will a car loan application secretly dent your credit score? Let’s break it down", "link": "https://www.livemint.com/money/personal-finance/will-a-car-loan-application-secretly-dent-your-credit-score-let-s-break-it-down-11765440774213.html", "published": "2025-12-11T14:23:59+00:00", "summary": "A car loan application can briefly reduce your credit score due to hard inquiries, but disciplined EMI repayment strengthens credit health and supports smarter borrowing decisions in the evolving lending landscape.", "source": "https://www.livemint.com/rss/money"}
{"title": "Home sweet home: The complete cost of ownership", "link": "https://www.livemint.com/money/personal-finance/home-ownership-cost-india-complete-financial-picture-loan-property-taxes-maintenance-bills-11765428550155.html", "published": "2025-12-11T13:51:45+00:00", "summary": "The actual cost of owning a house can vary significantly depending on several factors, including the property’s location, price of the home, financing terms, utilities, maintenance, etc.", "source": "https://www.livemint.com/rss/money"}
{"title": "AMFI November data: Equity mutual fund inflows surged 21% to  ₹29,911 crore", "link": "https://www.livemint.com/money/personal-finance/amfi-data-equity-fund-inflows-hit-29-911-crore-in-november-up-21-from-october-11765428080164.html", "published": "2025-12-11T11:12:33+00:00", "summary": "Equity mutual fund inflows rose to  ₹29,911 crore, while monthly SIP contributions declined slightly to  ₹29,445 crore.", "source": "https://www.livemint.com/rss/money"}
{"title": "ITR refund delay: What are common reasons, when to expect and how to check status? All you need to know", "link": "https://www.livemint.com/money/personal-finance/itr-refund-delay-what-are-common-reasons-when-to-expect-and-how-to-check-status-all-you-need-to-know-11765373518394.html", "published": "2025-12-10T20:29:01+00:00", "summary": "The ITR filing deadline was 16 September, and while most refunds are processed, some remain pending. Delays may arise from verification issues or incorrect bank details. Taxpayers should ensure Aadhaar-PAN linkage and accurate claims to avoid further processing delays.", "source": "https://www.livemint.com/rss/money"}
{"title": "IndiGo crisis: Liberalization is not enough if consumer trust is eroded", "link": "https://www.livemint.com/money/india-aviation-insurance-liberalization-governance-infrastructure-capital-consumer-trust-indigo-crisis-11765286640599.html", "published": "2025-12-10T18:55:50+00:00", "summary": "Both insurance and aviation touch the daily lives of millions of Indians and require deep infrastructure, robust regulation, and sustained capital to serve a rapidly expanding market. Yet, their journeys since liberalization could not have been more different.", "source": "https://www.livemint.com/rss/money"}
{"title": "What to do when banks refuse to reduce home loan interest rates", "link": "https://www.livemint.com/money/personal-finance/what-to-do-when-banks-refuse-to-reduce-home-loan-interest-rates-11765352219850.html", "published": "2025-12-10T14:36:20+00:00", "summary": "While banks use varied benchmark rates, they often slow interest rate reductions and cut EMIs, but not tenure. Borrowers can still benefit from the lowest repo rate in three years.&amp;nbsp;", "source": "https://www.livemint.com/rss/money"}
{"title": "RBI rate cut: Time to rethink your home loan strategy?", "link": "https://www.livemint.com/money/personal-finance/rbi-repo-rate-cut-home-loan-repayment-strategy-optimize-savings-lenders-borrowers-11765351622864.html", "published": "2025-12-10T14:25:06+00:00", "summary": "The latest RBI rate cuts will particularly benefit borrowers who took home loans in 2020-2022 at rates of 6-6.5%, but saw the rates rise to 9-9.5% within a year.", "source": "https://www.livemint.com/rss/money"}
{"title": "Startup backed by Altman, JPMorgan announces capital lending partnership with Amazon", "link": "https://www.cnbc.com/2025/12/16/slope-sam-altman-jpmorgan-amazon.html", "published": "2025-12-16T16:30:02+00:00", "summary": "Slope, an AI lending platform backed by JPMorgan Chase, told CNBC exclusively that it is launching a partnership with Amazon's independent sellers.", "source": "https://www.cnbc.com/id/10000664/device/rss/rss.html"}
{"title": "Hassett's Fed chair candidacy received pushback from high-level people close to Trump, sources say", "link": "https://www.cnbc.com/2025/12/15/hassetts-fed-chair-candidacy-received-pushback-from-high-level-people-close-to-trump-sources-say.html", "published": "2025-12-16T00:27:41+00:00", "summary": "There's concern that the National Economic Council director is too close to the president.", "source": "https://www.cnbc.com/id/10000664/device/rss/rss.html"}
{"title": "Goldman Sachs makes big bet on ETFs specializing in downside protection", "link": "https://www.cnbc.com/2025/12/13/goldman-sachs-makes-big-bet-on-etfs-focusing-on-downside-protection-.html", "published": "2025-12-13T22:13:08+00:00", "summary": "Goldman Sachs Asset Management is making a big bet on defined outcome exchange-traded funds — which use options to help protect against market losses.", "source": "https://www.cnbc.com/id/10000664/device/rss/rss.html"}
{"title": "Hassett Fed chair odds fall, Warsh chances surge on Kalshi after Trump comments", "link": "https://www.cnbc.com/2025/12/12/hassett-fed-chair-odds-fall-warsh-chances-surge-on-kalshi-after-trump-comments.html", "published": "2025-12-13T03:24:59+00:00", "summary": "Warsh's odds jumped to as high as 40% after Trump told the Wall Street Journal that Warsh has risen to the top of his list to be the next chair of the Fed.", "source": "https://www.cnbc.com/id/10000664/device/rss/rss.html"}
{"title": "Coinbase to soon unveil prediction markets powered by Kalshi, source says", "link": "https://www.cnbc.com/2025/12/12/coinbase-to-soon-unveil-prediction-markets-powered-by-kalshi-source-says.html", "published": "2025-12-13T03:29:19+00:00", "summary": "A source told CNBC that Coinbase will soon unveil prediction markets, powered by Kalshi, underscoring the firm's push to fulfill its \"everything exchange\" vision.", "source": "https://www.cnbc.com/id/10000664/device/rss/rss.html"}
{"title": "For investors all-in on Magnificent 7-led market, 'equal weight' is trending as stock call for 2026", "link": "https://www.cnbc.com/2025/12/12/stocks-market-risks-investors-portfolios-2026.html", "published": "2025-12-13T00:00:12+00:00", "summary": "With the S&amp;P 500 Index concentrated in a handful of tech stocks, the equal-weight market approach is getting more attention in portfolio planning for 2026.", "source": "https://www.cnbc.com/id/10000664/device/rss/rss.html"}
{"title": "Fed's Goolsbee says he's uncomfortable front-loading too many rate cuts", "link": "https://www.cnbc.com/2025/12/12/feds-goolsbee-explains-vote-against-rate-cut-says-central-bank-should-have-waited.html", "published": "2025-12-12T20:23:04+00:00", "summary": "Chicago Federal Reserve President Austan Goolsbee spoke Friday morning on CNBC.", "source": "https://www.cnbc.com/id/10000664/device/rss/rss.html"}
{"title": "Fed votes to reappoint all of its regional bank presidents", "link": "https://www.cnbc.com/2025/12/11/fed-votes-to-reappoint-all-of-its-regional-bank-presidents-.html", "published": "2025-12-12T20:52:20+00:00", "summary": "The Fed on Thursday reappointed 11 of its 12 regional bank presidents, ending a minidrama in a move that came a bit earlier than usual.", "source": "https://www.cnbc.com/id/10000664/device/rss/rss.html"}
{"title": "VanEck turns online slang into strategy with 'Degen Economy' ETF", "link": "https://www.cnbc.com/2025/12/11/vaneck-turns-online-slang-into-strategy-with-degen-economy-etf.html", "published": "2025-12-11T23:52:16+00:00", "summary": "The firm is renaming its gaming ETF (BJK) the \"VanEck Degen Economy ETF.\"", "source": "https://www.cnbc.com/id/10000664/device/rss/rss.html"}
{"title": "Goldman Sachs leads investment in software delivery startup Harness at $5.5 billion valuation", "link": "https://www.cnbc.com/2025/12/11/harness-is-worth-5point5-billion-in-round-led-by-goldman-sachs.html", "published": "2025-12-11T19:07:02+00:00", "summary": "Harness CEO Jyoti Bansal wants to eventually take Harness public after he sold his previous startup, AppDynamics, to Cisco just before a planned IPO.", "source": "https://www.cnbc.com/id/10000664/device/rss/rss.html"}
{"title": "Night owl bitcoin traders: Soon there'll be an ETF just for you", "link": "https://www.cnbc.com/2025/12/10/night-owl-bitcoin-traders-soon-therell-be-an-etf-just-for-you.html", "published": "2025-12-11T04:19:06+00:00", "summary": "If approved, the Nicholas Bitcoin and Treasuries AfterDark ETF would buy and sell bitcoin-linked financial instruments outside U.S. trading hours.", "source": "https://www.cnbc.com/id/10000664/device/rss/rss.html"}
{"title": "Here are the five big takeaways from Wednesday's Fed rate decision", "link": "https://www.cnbc.com/2025/12/10/here-are-the-five-big-takeaways-from-wednesdays-fed-rate-decision.html", "published": "2025-12-11T03:53:30+00:00", "summary": "The Fed approved a much-anticipated quarter percentage point interest rate cut at a meeting that was packed with intrigue and surprises.", "source": "https://www.cnbc.com/id/10000664/device/rss/rss.html"}
{"title": "The Fed is the most divided it's been in more than six years", "link": "https://www.cnbc.com/2025/12/10/the-fed-is-the-most-divided-its-been-in-more-than-a-decade.html", "published": "2025-12-11T17:44:34+00:00", "summary": "Three members of the Federal Open Market Committee didn't agree with the central bank's quarter percentage point cut on Wednesday.", "source": "https://www.cnbc.com/id/10000664/device/rss/rss.html"}
{"title": "Fed still forecasts just one rate cut for next year", "link": "https://www.cnbc.com/2025/12/10/feds-dot-plot-shows-one-rate-cut-for-next-year.html", "published": "2025-12-11T01:14:37+00:00", "summary": "The central bank's so-called dot plot indicates a median estimate of 3.4% for the federal funds rate at the end of 2026.", "source": "https://www.cnbc.com/id/10000664/device/rss/rss.html"}
{"title": "Here's what changed in the new Fed statement", "link": "https://www.cnbc.com/2025/12/10/fed-december-meeting-heres-what-changed-in-the-new-statement.html", "published": "2025-12-11T01:29:53+00:00", "summary": "This is a comparison of Wednesday's Federal Open Market Committee statement with the one issued after the Fed's previous policymaking meeting in October.", "source": "https://www.cnbc.com/id/10000664/device/rss/rss.html"}
{"title": "Divided Fed approves third rate cut this year, sees slower pace ahead", "link": "https://www.cnbc.com/2025/12/10/fed-interest-rate-decision-december-2025-.html", "published": "2025-12-11T02:23:51+00:00", "summary": "The Federal Reserve on Wednesday made its final final interest rate move of the year.", "source": "https://www.cnbc.com/id/10000664/device/rss/rss.html"}
{"title": "Trump to start final Fed chair interviews beginning with Kevin Warsh", "link": "https://www.cnbc.com/2025/12/10/trump-to-start-final-fed-chair-interviews-beginning-with-kevin-warsh.html", "published": "2025-12-10T23:43:31+00:00", "summary": "President Donald Trump will begin the final interviews of candidates for the Federal Reserve chair this week, putting back on track the formal selection process that began this summer.", "source": "https://www.cnbc.com/id/10000664/device/rss/rss.html"}
{"title": "IMF's Georgieva urges China to speed up 'long-overdue' shift away from relying on exports for growth, so as 'not to provoke' other countries", "link": "https://www.cnbc.com/2025/12/10/imfs-georgieva-urges-china-to-speed-up-shift-from-exports.html", "published": "2025-12-10T16:14:25+00:00", "summary": "IMF Managing Director Kristalina Georgieva said such a move was needed \"so as not to provoke other countries to take measures to curb down Chinese exports.\"", "source": "https://www.cnbc.com/id/10000664/device/rss/rss.html"}
{"title": "Supply chain diversification away from China is progressing from talks to action, EU chamber says", "link": "https://www.cnbc.com/2025/12/10/supply-chain-diversification-away-from-china-is-progressing-from-talks-to-action-eu-chamber-says.html", "published": "2025-12-10T12:02:15+00:00", "summary": "European Union Chamber of Commerce President Jens Eskelund expects more efforts to reduce reliance on China's supply chain.", "source": "https://www.cnbc.com/id/10000664/device/rss/rss.html"}
{"title": "The Fed meeting is likely to feature a rate cut and a lot more. Here's what to expect", "link": "https://www.cnbc.com/2025/12/09/the-fed-decision-is-expected-to-feature-a-rate-cut-and-a-lot-more-heres-what-to-expect.html", "published": "2025-12-10T23:38:52+00:00", "summary": "The central bank is poised to deliver its third straight interest rate cut Wednesday, while firing a warning shot about what's ahead.", "source": "https://www.cnbc.com/id/10000664/device/rss/rss.html"}
{"title": "There's no Dow or S&P 500 for cryptocurrencies yet. Bitwise is getting a step closer with new ETF", "link": "https://www.cnbc.com/2025/12/09/theres-no-dow-or-sp-500-for-cryptocurrencies-yet-bitwise-is-getting-a-step-closer-with-new-etf.html", "published": "2025-12-09T23:27:17+00:00", "summary": "The move comes despite a series of recent pullbacks in the crypto market that saw bitcoin trade at around $85,000 earlier this month.", "source": "https://www.cnbc.com/id/10000664/device/rss/rss.html"}
{"title": "Fifth Third signs deal making fintech firm Brex the provider of its commercial cards", "link": "https://www.cnbc.com/2025/12/09/fifth-third-bank-brex-commercial-cards-agreement.html", "published": "2025-12-10T01:56:43+00:00", "summary": "The move shows how some banks are choosing to partner with fintech firms rather than building their own platforms to keep up with evolving tech expectations.", "source": "https://www.cnbc.com/id/10000664/device/rss/rss.html"}
{"title": "Trump's pivot on Nvidia chips gives China a leg up over the U.S. in AI race, analysts say", "link": "https://www.cnbc.com/2025/12/09/trump-nvidia-chips-h200-china-us-ai-race.html", "published": "2025-12-10T05:04:03+00:00", "summary": "In the hours after U.S. President Donald Trump said Nvidia can sell a more advanced chip to China, several analysts said the move would give Beijing", "source": "https://www.cnbc.com/id/10000664/device/rss/rss.html"}
{"title": "Is bitcoin really digital gold? In 2025, the leading crypto has failed to answer that question", "link": "https://www.cnbc.com/2025/12/05/bitcoin-digital-gold-crypto-store-of-value.html", "published": "2025-12-05T21:04:25+00:00", "summary": "Bitcoin's big drop from a record price has led to questions about crypto's correlation to the broader market, and what it really represents in a portfolio.", "source": "https://www.cnbc.com/id/10000664/device/rss/rss.html"}
{"title": "London's answer to Wall Street gains momentum as major firms sign on", "link": "https://www.cnbc.com/2025/12/05/londons-canary-wharf-gains-momentum-as-visa-jpmorgan-lease-space.html", "published": "2025-12-05T19:19:11+00:00", "summary": "HSBC, BBVA, Barclays, Citibank and others have also recommitted to Canary Wharf in 2025.", "source": "https://www.cnbc.com/id/10000664/device/rss/rss.html"}
{"title": "$208 million wiped out: Yieldstreet investors rack up more losses as firm rebrands to Willow Wealth", "link": "https://www.cnbc.com/2025/12/05/yieldstreet-investors-losses-willow-wealth-rebrand.html", "published": "2025-12-05T18:45:57+00:00", "summary": "Yieldstreet is attempting to move past a troubled track record by rebranding to Willow Wealth while customers reel from a still-unfolding collapse of its funds.", "source": "https://www.cnbc.com/id/10000664/device/rss/rss.html"}
{"title": "SoFi's stock drops on $1.5 billion share sale announcement", "link": "https://www.cnbc.com/2025/12/04/sofi-stock-drops-on-1point5-billion-stock-offering.html", "published": "2025-12-05T04:35:50+00:00", "summary": "SoFi said it's selling $1.5 billion in stock after the company's market cap almost doubled this year.", "source": "https://www.cnbc.com/id/10000664/device/rss/rss.html"}
{"title": "Buyer beware? Increasingly complex ETFs may burn investors due to market backdrop", "link": "https://www.cnbc.com/2025/12/03/complex-etfs-offering-big-rewards-amp-up-market-risks.html", "published": "2025-12-03T17:30:01+00:00", "summary": "Retail investors may be getting in over their heads.", "source": "https://www.cnbc.com/id/10000664/device/rss/rss.html"}
{"title": "Kalshi makes move to court crypto traders with tokenized betting contracts", "link": "https://www.cnbc.com/2025/12/01/kalshi-makes-move-to-court-crypto-traders-with-tokenized-betting-contracts.html", "published": "2025-12-02T01:27:25+00:00", "summary": "Tokenization refers to creating a digital version of a real-world financial asset such as a stock, bond or treasury note.", "source": "https://www.cnbc.com/id/10000664/device/rss/rss.html"}
{"title": "As regime change looms at the Fed, one candidate emerges as front-runner for chair", "link": "https://www.cnbc.com/2025/12/01/as-regime-change-looms-at-the-fed-one-candidate-emerges-as-frontrunner-for-chair.html", "published": "2025-12-02T19:42:17+00:00", "summary": "President Donald Trump knows who he's going to select as the next Federal Reserve chair but isn't saying yet.", "source": "https://www.cnbc.com/id/10000664/device/rss/rss.html"}
